Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x27be (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><c>: Abbrev Number: 43 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x2986): GNU C11 11.3.1 20220712 -mcpu=cortex-m7 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fpv5 -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xd67a5): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0xde12a): C:/Users/yarde/STM32CubeIDE/workspace_1.13.1/freeRTOS_final_project/Debug
    <1a>   DW_AT_ranges      : 0x1b
    <1e>   DW_AT_low_pc      : 0x0
    <22>   DW_AT_stmt_list   : 0x0
    <26>   DW_AT_macros      : 0x0
 <1><2a>: Abbrev Number: 17 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x78546): signed char
 <1><31>: Abbrev Number: 5 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x4640e): __uint8_t
    <36>   DW_AT_decl_file   : 3
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 17 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0xe8c0d): unsigned char
 <1><44>: Abbrev Number: 17 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0xb332f): short int
 <1><4b>: Abbrev Number: 5 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0xc48d0): __uint16_t
    <50>   DW_AT_decl_file   : 3
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 17 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0xe71be): short unsigned int
 <1><5e>: Abbrev Number: 17 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x14a4c): long int
 <1><65>: Abbrev Number: 5 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x98702): __uint32_t
    <6a>   DW_AT_decl_file   : 3
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 17 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x5c092): long unsigned int
 <1><78>: Abbrev Number: 17 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x6d628): long long int
 <1><7f>: Abbrev Number: 17 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x32a7c): long long unsigned int
 <1><86>: Abbrev Number: 44 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 17 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x13cff): unsigned int
 <1><94>: Abbrev Number: 5 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x46410): uint8_t
    <99>   DW_AT_decl_file   : 4
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 18 (DW_TAG_volatile_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 15 (DW_TAG_const_type)
    <a6>   DW_AT_type        : <0x94>
 <1><aa>: Abbrev Number: 5 (DW_TAG_typedef)
    <ab>   DW_AT_name        : (indirect string, offset: 0xaff56): uint16_t
    <af>   DW_AT_decl_file   : 4
    <b0>   DW_AT_decl_line   : 36
    <b1>   DW_AT_decl_column : 20
    <b2>   DW_AT_type        : <0x4b>
 <1><b6>: Abbrev Number: 18 (DW_TAG_volatile_type)
    <b7>   DW_AT_type        : <0xaa>
 <1><bb>: Abbrev Number: 15 (DW_TAG_const_type)
    <bc>   DW_AT_type        : <0xaa>
 <1><c0>: Abbrev Number: 5 (DW_TAG_typedef)
    <c1>   DW_AT_name        : (indirect string, offset: 0xe6da4): uint32_t
    <c5>   DW_AT_decl_file   : 4
    <c6>   DW_AT_decl_line   : 48
    <c7>   DW_AT_decl_column : 20
    <c8>   DW_AT_type        : <0x65>
 <1><cc>: Abbrev Number: 18 (DW_TAG_volatile_type)
    <cd>   DW_AT_type        : <0xc0>
 <1><d1>: Abbrev Number: 10 (DW_TAG_array_type)
    <d2>   DW_AT_type        : <0xc0>
    <d6>   DW_AT_sibling     : <0xe1>
 <2><da>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <db>   DW_AT_type        : <0x8d>
    <df>   DW_AT_upper_bound : 1
 <2><e0>: Abbrev Number: 0
 <1><e1>: Abbrev Number: 10 (DW_TAG_array_type)
    <e2>   DW_AT_type        : <0xc0>
    <e6>   DW_AT_sibling     : <0xf1>
 <2><ea>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <eb>   DW_AT_type        : <0x8d>
    <ef>   DW_AT_upper_bound : 7
 <2><f0>: Abbrev Number: 0
 <1><f1>: Abbrev Number: 10 (DW_TAG_array_type)
    <f2>   DW_AT_type        : <0xc0>
    <f6>   DW_AT_sibling     : <0x101>
 <2><fa>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <fb>   DW_AT_type        : <0x8d>
    <ff>   DW_AT_upper_bound : 11
 <2><100>: Abbrev Number: 0
 <1><101>: Abbrev Number: 22 (DW_TAG_structure_type)
    <102>   DW_AT_byte_size   : 24
    <103>   DW_AT_decl_file   : 5
    <104>   DW_AT_decl_line   : 372
    <106>   DW_AT_decl_column : 9
    <106>   DW_AT_sibling     : <0x158>
 <2><10a>: Abbrev Number: 12 (DW_TAG_member)
    <10b>   DW_AT_name        : CR
    <10e>   DW_AT_decl_file   : 5
    <10e>   DW_AT_decl_line   : 374
    <110>   DW_AT_decl_column : 17
    <110>   DW_AT_type        : <0xcc>
    <114>   DW_AT_data_member_location: 0
 <2><115>: Abbrev Number: 2 (DW_TAG_member)
    <116>   DW_AT_name        : (indirect string, offset: 0xb4cd6): NDTR
    <11a>   DW_AT_decl_file   : 5
    <11b>   DW_AT_decl_line   : 375
    <11d>   DW_AT_decl_column : 17
    <11e>   DW_AT_type        : <0xcc>
    <122>   DW_AT_data_member_location: 4
 <2><123>: Abbrev Number: 12 (DW_TAG_member)
    <124>   DW_AT_name        : PAR
    <128>   DW_AT_decl_file   : 5
    <128>   DW_AT_decl_line   : 376
    <12a>   DW_AT_decl_column : 17
    <12a>   DW_AT_type        : <0xcc>
    <12e>   DW_AT_data_member_location: 8
 <2><12f>: Abbrev Number: 2 (DW_TAG_member)
    <130>   DW_AT_name        : (indirect string, offset: 0x63fe2): M0AR
    <134>   DW_AT_decl_file   : 5
    <135>   DW_AT_decl_line   : 377
    <137>   DW_AT_decl_column : 17
    <138>   DW_AT_type        : <0xcc>
    <13c>   DW_AT_data_member_location: 12
 <2><13d>: Abbrev Number: 2 (DW_TAG_member)
    <13e>   DW_AT_name        : (indirect string, offset: 0x8471f): M1AR
    <142>   DW_AT_decl_file   : 5
    <143>   DW_AT_decl_line   : 378
    <145>   DW_AT_decl_column : 17
    <146>   DW_AT_type        : <0xcc>
    <14a>   DW_AT_data_member_location: 16
 <2><14b>: Abbrev Number: 12 (DW_TAG_member)
    <14c>   DW_AT_name        : FCR
    <150>   DW_AT_decl_file   : 5
    <150>   DW_AT_decl_line   : 379
    <152>   DW_AT_decl_column : 17
    <152>   DW_AT_type        : <0xcc>
    <156>   DW_AT_data_member_location: 20
 <2><157>: Abbrev Number: 0
 <1><158>: Abbrev Number: 14 (DW_TAG_typedef)
    <159>   DW_AT_name        : (indirect string, offset: 0x1dfbd): DMA_Stream_TypeDef
    <15d>   DW_AT_decl_file   : 5
    <15e>   DW_AT_decl_line   : 380
    <160>   DW_AT_decl_column : 3
    <161>   DW_AT_type        : <0x101>
 <1><165>: Abbrev Number: 33 (DW_TAG_structure_type)
    <166>   DW_AT_byte_size   : 4184
    <168>   DW_AT_decl_file   : 5
    <168>   DW_AT_decl_line   : 426
    <16a>   DW_AT_decl_column : 9
    <16a>   DW_AT_sibling     : <0x4fb>
 <2><16e>: Abbrev Number: 2 (DW_TAG_member)
    <16f>   DW_AT_name        : (indirect string, offset: 0x462d1): MACCR
    <173>   DW_AT_decl_file   : 5
    <174>   DW_AT_decl_line   : 428
    <176>   DW_AT_decl_column : 17
    <177>   DW_AT_type        : <0xcc>
    <17b>   DW_AT_data_member_location: 0
 <2><17c>: Abbrev Number: 2 (DW_TAG_member)
    <17d>   DW_AT_name        : (indirect string, offset: 0x70826): MACFFR
    <181>   DW_AT_decl_file   : 5
    <182>   DW_AT_decl_line   : 429
    <184>   DW_AT_decl_column : 17
    <185>   DW_AT_type        : <0xcc>
    <189>   DW_AT_data_member_location: 4
 <2><18a>: Abbrev Number: 2 (DW_TAG_member)
    <18b>   DW_AT_name        : (indirect string, offset: 0x8e37f): MACHTHR
    <18f>   DW_AT_decl_file   : 5
    <190>   DW_AT_decl_line   : 430
    <192>   DW_AT_decl_column : 17
    <193>   DW_AT_type        : <0xcc>
    <197>   DW_AT_data_member_location: 8
 <2><198>: Abbrev Number: 2 (DW_TAG_member)
    <199>   DW_AT_name        : (indirect string, offset: 0x902ce): MACHTLR
    <19d>   DW_AT_decl_file   : 5
    <19e>   DW_AT_decl_line   : 431
    <1a0>   DW_AT_decl_column : 17
    <1a1>   DW_AT_type        : <0xcc>
    <1a5>   DW_AT_data_member_location: 12
 <2><1a6>: Abbrev Number: 2 (DW_TAG_member)
    <1a7>   DW_AT_name        : (indirect string, offset: 0xe8ca7): MACMIIAR
    <1ab>   DW_AT_decl_file   : 5
    <1ac>   DW_AT_decl_line   : 432
    <1ae>   DW_AT_decl_column : 17
    <1af>   DW_AT_type        : <0xcc>
    <1b3>   DW_AT_data_member_location: 16
 <2><1b4>: Abbrev Number: 2 (DW_TAG_member)
    <1b5>   DW_AT_name        : (indirect string, offset: 0xea253): MACMIIDR
    <1b9>   DW_AT_decl_file   : 5
    <1ba>   DW_AT_decl_line   : 433
    <1bc>   DW_AT_decl_column : 17
    <1bd>   DW_AT_type        : <0xcc>
    <1c1>   DW_AT_data_member_location: 20
 <2><1c2>: Abbrev Number: 2 (DW_TAG_member)
    <1c3>   DW_AT_name        : (indirect string, offset: 0x61e20): MACFCR
    <1c7>   DW_AT_decl_file   : 5
    <1c8>   DW_AT_decl_line   : 434
    <1ca>   DW_AT_decl_column : 17
    <1cb>   DW_AT_type        : <0xcc>
    <1cf>   DW_AT_data_member_location: 24
 <2><1d0>: Abbrev Number: 2 (DW_TAG_member)
    <1d1>   DW_AT_name        : (indirect string, offset: 0x5f4c7): MACVLANTR
    <1d5>   DW_AT_decl_file   : 5
    <1d6>   DW_AT_decl_line   : 435
    <1d8>   DW_AT_decl_column : 17
    <1d9>   DW_AT_type        : <0xcc>
    <1dd>   DW_AT_data_member_location: 28
 <2><1de>: Abbrev Number: 2 (DW_TAG_member)
    <1df>   DW_AT_name        : (indirect string, offset: 0xe37ca): RESERVED0
    <1e3>   DW_AT_decl_file   : 5
    <1e4>   DW_AT_decl_line   : 436
    <1e6>   DW_AT_decl_column : 17
    <1e7>   DW_AT_type        : <0xd1>
    <1eb>   DW_AT_data_member_location: 32
 <2><1ec>: Abbrev Number: 2 (DW_TAG_member)
    <1ed>   DW_AT_name        : (indirect string, offset: 0xa9c00): MACRWUFFR
    <1f1>   DW_AT_decl_file   : 5
    <1f2>   DW_AT_decl_line   : 437
    <1f4>   DW_AT_decl_column : 17
    <1f5>   DW_AT_type        : <0xcc>
    <1f9>   DW_AT_data_member_location: 40
 <2><1fa>: Abbrev Number: 2 (DW_TAG_member)
    <1fb>   DW_AT_name        : (indirect string, offset: 0x11412): MACPMTCSR
    <1ff>   DW_AT_decl_file   : 5
    <200>   DW_AT_decl_line   : 438
    <202>   DW_AT_decl_column : 17
    <203>   DW_AT_type        : <0xcc>
    <207>   DW_AT_data_member_location: 44
 <2><208>: Abbrev Number: 2 (DW_TAG_member)
    <209>   DW_AT_name        : (indirect string, offset: 0xe37d4): RESERVED1
    <20d>   DW_AT_decl_file   : 5
    <20e>   DW_AT_decl_line   : 439
    <210>   DW_AT_decl_column : 17
    <211>   DW_AT_type        : <0xc0>
    <215>   DW_AT_data_member_location: 48
 <2><216>: Abbrev Number: 2 (DW_TAG_member)
    <217>   DW_AT_name        : (indirect string, offset: 0x5d625): MACDBGR
    <21b>   DW_AT_decl_file   : 5
    <21c>   DW_AT_decl_line   : 440
    <21e>   DW_AT_decl_column : 17
    <21f>   DW_AT_type        : <0xcc>
    <223>   DW_AT_data_member_location: 52
 <2><224>: Abbrev Number: 2 (DW_TAG_member)
    <225>   DW_AT_name        : (indirect string, offset: 0x4de91): MACSR
    <229>   DW_AT_decl_file   : 5
    <22a>   DW_AT_decl_line   : 441
    <22c>   DW_AT_decl_column : 17
    <22d>   DW_AT_type        : <0xcc>
    <231>   DW_AT_data_member_location: 56
 <2><232>: Abbrev Number: 2 (DW_TAG_member)
    <233>   DW_AT_name        : (indirect string, offset: 0xca304): MACIMR
    <237>   DW_AT_decl_file   : 5
    <238>   DW_AT_decl_line   : 442
    <23a>   DW_AT_decl_column : 17
    <23b>   DW_AT_type        : <0xcc>
    <23f>   DW_AT_data_member_location: 60
 <2><240>: Abbrev Number: 2 (DW_TAG_member)
    <241>   DW_AT_name        : (indirect string, offset: 0x59291): MACA0HR
    <245>   DW_AT_decl_file   : 5
    <246>   DW_AT_decl_line   : 443
    <248>   DW_AT_decl_column : 17
    <249>   DW_AT_type        : <0xcc>
    <24d>   DW_AT_data_member_location: 64
 <2><24e>: Abbrev Number: 2 (DW_TAG_member)
    <24f>   DW_AT_name        : (indirect string, offset: 0x5b3ba): MACA0LR
    <253>   DW_AT_decl_file   : 5
    <254>   DW_AT_decl_line   : 444
    <256>   DW_AT_decl_column : 17
    <257>   DW_AT_type        : <0xcc>
    <25b>   DW_AT_data_member_location: 68
 <2><25c>: Abbrev Number: 2 (DW_TAG_member)
    <25d>   DW_AT_name        : (indirect string, offset: 0x79f39): MACA1HR
    <261>   DW_AT_decl_file   : 5
    <262>   DW_AT_decl_line   : 445
    <264>   DW_AT_decl_column : 17
    <265>   DW_AT_type        : <0xcc>
    <269>   DW_AT_data_member_location: 72
 <2><26a>: Abbrev Number: 2 (DW_TAG_member)
    <26b>   DW_AT_name        : (indirect string, offset: 0x7bcc5): MACA1LR
    <26f>   DW_AT_decl_file   : 5
    <270>   DW_AT_decl_line   : 446
    <272>   DW_AT_decl_column : 17
    <273>   DW_AT_type        : <0xcc>
    <277>   DW_AT_data_member_location: 76
 <2><278>: Abbrev Number: 2 (DW_TAG_member)
    <279>   DW_AT_name        : (indirect string, offset: 0x9c26a): MACA2HR
    <27d>   DW_AT_decl_file   : 5
    <27e>   DW_AT_decl_line   : 447
    <280>   DW_AT_decl_column : 17
    <281>   DW_AT_type        : <0xcc>
    <285>   DW_AT_data_member_location: 80
 <2><286>: Abbrev Number: 2 (DW_TAG_member)
    <287>   DW_AT_name        : (indirect string, offset: 0x9e672): MACA2LR
    <28b>   DW_AT_decl_file   : 5
    <28c>   DW_AT_decl_line   : 448
    <28e>   DW_AT_decl_column : 17
    <28f>   DW_AT_type        : <0xcc>
    <293>   DW_AT_data_member_location: 84
 <2><294>: Abbrev Number: 2 (DW_TAG_member)
    <295>   DW_AT_name        : (indirect string, offset: 0xbcb6a): MACA3HR
    <299>   DW_AT_decl_file   : 5
    <29a>   DW_AT_decl_line   : 449
    <29c>   DW_AT_decl_column : 17
    <29d>   DW_AT_type        : <0xcc>
    <2a1>   DW_AT_data_member_location: 88
 <2><2a2>: Abbrev Number: 2 (DW_TAG_member)
    <2a3>   DW_AT_name        : (indirect string, offset: 0xbe85e): MACA3LR
    <2a7>   DW_AT_decl_file   : 5
    <2a8>   DW_AT_decl_line   : 450
    <2aa>   DW_AT_decl_column : 17
    <2ab>   DW_AT_type        : <0xcc>
    <2af>   DW_AT_data_member_location: 92
 <2><2b0>: Abbrev Number: 2 (DW_TAG_member)
    <2b1>   DW_AT_name        : (indirect string, offset: 0xe37de): RESERVED2
    <2b5>   DW_AT_decl_file   : 5
    <2b6>   DW_AT_decl_line   : 451
    <2b8>   DW_AT_decl_column : 17
    <2b9>   DW_AT_type        : <0x4fb>
    <2bd>   DW_AT_data_member_location: 96
 <2><2be>: Abbrev Number: 6 (DW_TAG_member)
    <2bf>   DW_AT_name        : (indirect string, offset: 0x974d5): MMCCR
    <2c3>   DW_AT_decl_file   : 5
    <2c3>   DW_AT_decl_line   : 452
    <2c5>   DW_AT_decl_column : 17
    <2c5>   DW_AT_type        : <0xcc>
    <2c9>   DW_AT_data_member_location: 256
 <2><2cb>: Abbrev Number: 6 (DW_TAG_member)
    <2cc>   DW_AT_name        : (indirect string, offset: 0xdb5ca): MMCRIR
    <2d0>   DW_AT_decl_file   : 5
    <2d0>   DW_AT_decl_line   : 453
    <2d2>   DW_AT_decl_column : 17
    <2d2>   DW_AT_type        : <0xcc>
    <2d6>   DW_AT_data_member_location: 260
 <2><2d8>: Abbrev Number: 6 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x2c0bc): MMCTIR
    <2dd>   DW_AT_decl_file   : 5
    <2dd>   DW_AT_decl_line   : 454
    <2df>   DW_AT_decl_column : 17
    <2df>   DW_AT_type        : <0xcc>
    <2e3>   DW_AT_data_member_location: 264
 <2><2e5>: Abbrev Number: 6 (DW_TAG_member)
    <2e6>   DW_AT_name        : (indirect string, offset: 0x2efae): MMCRIMR
    <2ea>   DW_AT_decl_file   : 5
    <2ea>   DW_AT_decl_line   : 455
    <2ec>   DW_AT_decl_column : 17
    <2ec>   DW_AT_type        : <0xcc>
    <2f0>   DW_AT_data_member_location: 268
 <2><2f2>: Abbrev Number: 6 (DW_TAG_member)
    <2f3>   DW_AT_name        : (indirect string, offset: 0x86746): MMCTIMR
    <2f7>   DW_AT_decl_file   : 5
    <2f7>   DW_AT_decl_line   : 456
    <2f9>   DW_AT_decl_column : 17
    <2f9>   DW_AT_type        : <0xcc>
    <2fd>   DW_AT_data_member_location: 272
 <2><2ff>: Abbrev Number: 6 (DW_TAG_member)
    <300>   DW_AT_name        : (indirect string, offset: 0xe37e8): RESERVED3
    <304>   DW_AT_decl_file   : 5
    <304>   DW_AT_decl_line   : 457
    <306>   DW_AT_decl_column : 17
    <306>   DW_AT_type        : <0x50b>
    <30a>   DW_AT_data_member_location: 276
 <2><30c>: Abbrev Number: 6 (DW_TAG_member)
    <30d>   DW_AT_name        : (indirect string, offset: 0x805f2): MMCTGFSCCR
    <311>   DW_AT_decl_file   : 5
    <311>   DW_AT_decl_line   : 458
    <313>   DW_AT_decl_column : 17
    <313>   DW_AT_type        : <0xcc>
    <317>   DW_AT_data_member_location: 332
 <2><319>: Abbrev Number: 6 (DW_TAG_member)
    <31a>   DW_AT_name        : (indirect string, offset: 0x926f5): MMCTGFMSCCR
    <31e>   DW_AT_decl_file   : 5
    <31e>   DW_AT_decl_line   : 459
    <320>   DW_AT_decl_column : 17
    <320>   DW_AT_type        : <0xcc>
    <324>   DW_AT_data_member_location: 336
 <2><326>: Abbrev Number: 6 (DW_TAG_member)
    <327>   DW_AT_name        : (indirect string, offset: 0xe37f2): RESERVED4
    <32b>   DW_AT_decl_file   : 5
    <32b>   DW_AT_decl_line   : 460
    <32d>   DW_AT_decl_column : 17
    <32d>   DW_AT_type        : <0x51b>
    <331>   DW_AT_data_member_location: 340
 <2><333>: Abbrev Number: 6 (DW_TAG_member)
    <334>   DW_AT_name        : (indirect string, offset: 0x717e1): MMCTGFCR
    <338>   DW_AT_decl_file   : 5
    <338>   DW_AT_decl_line   : 461
    <33a>   DW_AT_decl_column : 17
    <33a>   DW_AT_type        : <0xcc>
    <33e>   DW_AT_data_member_location: 360
 <2><340>: Abbrev Number: 6 (DW_TAG_member)
    <341>   DW_AT_name        : (indirect string, offset: 0xe37fc): RESERVED5
    <345>   DW_AT_decl_file   : 5
    <345>   DW_AT_decl_line   : 462
    <347>   DW_AT_decl_column : 17
    <347>   DW_AT_type        : <0x52b>
    <34b>   DW_AT_data_member_location: 364
 <2><34d>: Abbrev Number: 6 (DW_TAG_member)
    <34e>   DW_AT_name        : (indirect string, offset: 0x914ed): MMCRFCECR
    <352>   DW_AT_decl_file   : 5
    <352>   DW_AT_decl_line   : 463
    <354>   DW_AT_decl_column : 17
    <354>   DW_AT_type        : <0xcc>
    <358>   DW_AT_data_member_location: 404
 <2><35a>: Abbrev Number: 6 (DW_TAG_member)
    <35b>   DW_AT_name        : (indirect string, offset: 0x3986f): MMCRFAECR
    <35f>   DW_AT_decl_file   : 5
    <35f>   DW_AT_decl_line   : 464
    <361>   DW_AT_decl_column : 17
    <361>   DW_AT_type        : <0xcc>
    <365>   DW_AT_data_member_location: 408
 <2><367>: Abbrev Number: 6 (DW_TAG_member)
    <368>   DW_AT_name        : (indirect string, offset: 0x8e895): RESERVED6
    <36c>   DW_AT_decl_file   : 5
    <36c>   DW_AT_decl_line   : 465
    <36e>   DW_AT_decl_column : 17
    <36e>   DW_AT_type        : <0x52b>
    <372>   DW_AT_data_member_location: 412
 <2><374>: Abbrev Number: 6 (DW_TAG_member)
    <375>   DW_AT_name        : (indirect string, offset: 0x59e6b): MMCRGUFCR
    <379>   DW_AT_decl_file   : 5
    <379>   DW_AT_decl_line   : 466
    <37b>   DW_AT_decl_column : 17
    <37b>   DW_AT_type        : <0xcc>
    <37f>   DW_AT_data_member_location: 452
 <2><381>: Abbrev Number: 6 (DW_TAG_member)
    <382>   DW_AT_name        : (indirect string, offset: 0xe3837): RESERVED7
    <386>   DW_AT_decl_file   : 5
    <386>   DW_AT_decl_line   : 467
    <388>   DW_AT_decl_column : 17
    <388>   DW_AT_type        : <0x53b>
    <38c>   DW_AT_data_member_location: 456
 <2><38e>: Abbrev Number: 6 (DW_TAG_member)
    <38f>   DW_AT_name        : (indirect string, offset: 0x64459): PTPTSCR
    <393>   DW_AT_decl_file   : 5
    <393>   DW_AT_decl_line   : 468
    <395>   DW_AT_decl_column : 17
    <395>   DW_AT_type        : <0xcc>
    <399>   DW_AT_data_member_location: 1792
 <2><39b>: Abbrev Number: 6 (DW_TAG_member)
    <39c>   DW_AT_name        : (indirect string, offset: 0x3b1ed): PTPSSIR
    <3a0>   DW_AT_decl_file   : 5
    <3a0>   DW_AT_decl_line   : 469
    <3a2>   DW_AT_decl_column : 17
    <3a2>   DW_AT_type        : <0xcc>
    <3a6>   DW_AT_data_member_location: 1796
 <2><3a8>: Abbrev Number: 6 (DW_TAG_member)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x66af7): PTPTSHR
    <3ad>   DW_AT_decl_file   : 5
    <3ad>   DW_AT_decl_line   : 470
    <3af>   DW_AT_decl_column : 17
    <3af>   DW_AT_type        : <0xcc>
    <3b3>   DW_AT_data_member_location: 1800
 <2><3b5>: Abbrev Number: 6 (DW_TAG_member)
    <3b6>   DW_AT_name        : (indirect string, offset: 0x68734): PTPTSLR
    <3ba>   DW_AT_decl_file   : 5
    <3ba>   DW_AT_decl_line   : 471
    <3bc>   DW_AT_decl_column : 17
    <3bc>   DW_AT_type        : <0xcc>
    <3c0>   DW_AT_data_member_location: 1804
 <2><3c2>: Abbrev Number: 6 (DW_TAG_member)
    <3c3>   DW_AT_name        : (indirect string, offset: 0x86c17): PTPTSHUR
    <3c7>   DW_AT_decl_file   : 5
    <3c7>   DW_AT_decl_line   : 472
    <3c9>   DW_AT_decl_column : 17
    <3c9>   DW_AT_type        : <0xcc>
    <3cd>   DW_AT_data_member_location: 1808
 <2><3cf>: Abbrev Number: 6 (DW_TAG_member)
    <3d0>   DW_AT_name        : (indirect string, offset: 0x1adc1): PTPTSLUR
    <3d4>   DW_AT_decl_file   : 5
    <3d4>   DW_AT_decl_line   : 473
    <3d6>   DW_AT_decl_column : 17
    <3d6>   DW_AT_type        : <0xcc>
    <3da>   DW_AT_data_member_location: 1812
 <2><3dc>: Abbrev Number: 6 (DW_TAG_member)
    <3dd>   DW_AT_name        : (indirect string, offset: 0x63478): PTPTSAR
    <3e1>   DW_AT_decl_file   : 5
    <3e1>   DW_AT_decl_line   : 474
    <3e3>   DW_AT_decl_column : 17
    <3e3>   DW_AT_type        : <0xcc>
    <3e7>   DW_AT_data_member_location: 1816
 <2><3e9>: Abbrev Number: 6 (DW_TAG_member)
    <3ea>   DW_AT_name        : (indirect string, offset: 0x874f5): PTPTTHR
    <3ee>   DW_AT_decl_file   : 5
    <3ee>   DW_AT_decl_line   : 475
    <3f0>   DW_AT_decl_column : 17
    <3f0>   DW_AT_type        : <0xcc>
    <3f4>   DW_AT_data_member_location: 1820
 <2><3f6>: Abbrev Number: 6 (DW_TAG_member)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x89985): PTPTTLR
    <3fb>   DW_AT_decl_file   : 5
    <3fb>   DW_AT_decl_line   : 476
    <3fd>   DW_AT_decl_column : 17
    <3fd>   DW_AT_type        : <0xcc>
    <401>   DW_AT_data_member_location: 1824
 <2><403>: Abbrev Number: 6 (DW_TAG_member)
    <404>   DW_AT_name        : (indirect string, offset: 0x8e8d5): RESERVED8
    <408>   DW_AT_decl_file   : 5
    <408>   DW_AT_decl_line   : 477
    <40a>   DW_AT_decl_column : 17
    <40a>   DW_AT_type        : <0xcc>
    <40e>   DW_AT_data_member_location: 1828
 <2><410>: Abbrev Number: 6 (DW_TAG_member)
    <411>   DW_AT_name        : (indirect string, offset: 0x6baf0): PTPTSSR
    <415>   DW_AT_decl_file   : 5
    <415>   DW_AT_decl_line   : 478
    <417>   DW_AT_decl_column : 17
    <417>   DW_AT_type        : <0xcc>
    <41b>   DW_AT_data_member_location: 1832
 <2><41d>: Abbrev Number: 6 (DW_TAG_member)
    <41e>   DW_AT_name        : (indirect string, offset: 0x30dd1): PTPPPSCR
    <422>   DW_AT_decl_file   : 5
    <422>   DW_AT_decl_line   : 479
    <424>   DW_AT_decl_column : 17
    <424>   DW_AT_type        : <0xcc>
    <428>   DW_AT_data_member_location: 1836
 <2><42a>: Abbrev Number: 6 (DW_TAG_member)
    <42b>   DW_AT_name        : (indirect string, offset: 0xe386e): RESERVED9
    <42f>   DW_AT_decl_file   : 5
    <42f>   DW_AT_decl_line   : 480
    <431>   DW_AT_decl_column : 17
    <431>   DW_AT_type        : <0x54c>
    <435>   DW_AT_data_member_location: 1840
 <2><437>: Abbrev Number: 6 (DW_TAG_member)
    <438>   DW_AT_name        : (indirect string, offset: 0x43b0e): DMABMR
    <43c>   DW_AT_decl_file   : 5
    <43c>   DW_AT_decl_line   : 481
    <43e>   DW_AT_decl_column : 17
    <43e>   DW_AT_type        : <0xcc>
    <442>   DW_AT_data_member_location: 4096
 <2><444>: Abbrev Number: 6 (DW_TAG_member)
    <445>   DW_AT_name        : (indirect string, offset: 0xb8c0a): DMATPDR
    <449>   DW_AT_decl_file   : 5
    <449>   DW_AT_decl_line   : 482
    <44b>   DW_AT_decl_column : 17
    <44b>   DW_AT_type        : <0xcc>
    <44f>   DW_AT_data_member_location: 4100
 <2><451>: Abbrev Number: 6 (DW_TAG_member)
    <452>   DW_AT_name        : (indirect string, offset: 0xb5f5e): DMARPDR
    <456>   DW_AT_decl_file   : 5
    <456>   DW_AT_decl_line   : 483
    <458>   DW_AT_decl_column : 17
    <458>   DW_AT_type        : <0xcc>
    <45c>   DW_AT_data_member_location: 4104
 <2><45e>: Abbrev Number: 6 (DW_TAG_member)
    <45f>   DW_AT_name        : (indirect string, offset: 0x555ac): DMARDLAR
    <463>   DW_AT_decl_file   : 5
    <463>   DW_AT_decl_line   : 484
    <465>   DW_AT_decl_column : 17
    <465>   DW_AT_type        : <0xcc>
    <469>   DW_AT_data_member_location: 4108
 <2><46b>: Abbrev Number: 6 (DW_TAG_member)
    <46c>   DW_AT_name        : (indirect string, offset: 0xf05bb): DMATDLAR
    <470>   DW_AT_decl_file   : 5
    <470>   DW_AT_decl_line   : 485
    <472>   DW_AT_decl_column : 17
    <472>   DW_AT_type        : <0xcc>
    <476>   DW_AT_data_member_location: 4112
 <2><478>: Abbrev Number: 6 (DW_TAG_member)
    <479>   DW_AT_name        : (indirect string, offset: 0x5a128): DMASR
    <47d>   DW_AT_decl_file   : 5
    <47d>   DW_AT_decl_line   : 486
    <47f>   DW_AT_decl_column : 17
    <47f>   DW_AT_type        : <0xcc>
    <483>   DW_AT_data_member_location: 4116
 <2><485>: Abbrev Number: 6 (DW_TAG_member)
    <486>   DW_AT_name        : (indirect string, offset: 0x2ebed): DMAOMR
    <48a>   DW_AT_decl_file   : 5
    <48a>   DW_AT_decl_line   : 487
    <48c>   DW_AT_decl_column : 17
    <48c>   DW_AT_type        : <0xcc>
    <490>   DW_AT_data_member_location: 4120
 <2><492>: Abbrev Number: 6 (DW_TAG_member)
    <493>   DW_AT_name        : (indirect string, offset: 0x54b40): DMAIER
    <497>   DW_AT_decl_file   : 5
    <497>   DW_AT_decl_line   : 488
    <499>   DW_AT_decl_column : 17
    <499>   DW_AT_type        : <0xcc>
    <49d>   DW_AT_data_member_location: 4124
 <2><49f>: Abbrev Number: 6 (DW_TAG_member)
    <4a0>   DW_AT_name        : (indirect string, offset: 0xb50d5): DMAMFBOCR
    <4a4>   DW_AT_decl_file   : 5
    <4a4>   DW_AT_decl_line   : 489
    <4a6>   DW_AT_decl_column : 17
    <4a6>   DW_AT_type        : <0xcc>
    <4aa>   DW_AT_data_member_location: 4128
 <2><4ac>: Abbrev Number: 6 (DW_TAG_member)
    <4ad>   DW_AT_name        : (indirect string, offset: 0xb3acd): DMARSWTR
    <4b1>   DW_AT_decl_file   : 5
    <4b1>   DW_AT_decl_line   : 490
    <4b3>   DW_AT_decl_column : 17
    <4b3>   DW_AT_type        : <0xcc>
    <4b7>   DW_AT_data_member_location: 4132
 <2><4b9>: Abbrev Number: 6 (DW_TAG_member)
    <4ba>   DW_AT_name        : (indirect string, offset: 0x212d5): RESERVED10
    <4be>   DW_AT_decl_file   : 5
    <4be>   DW_AT_decl_line   : 491
    <4c0>   DW_AT_decl_column : 17
    <4c0>   DW_AT_type        : <0xe1>
    <4c4>   DW_AT_data_member_location: 4136
 <2><4c6>: Abbrev Number: 6 (DW_TAG_member)
    <4c7>   DW_AT_name        : (indirect string, offset: 0x5df74): DMACHTDR
    <4cb>   DW_AT_decl_file   : 5
    <4cb>   DW_AT_decl_line   : 492
    <4cd>   DW_AT_decl_column : 17
    <4cd>   DW_AT_type        : <0xcc>
    <4d1>   DW_AT_data_member_location: 4168
 <2><4d3>: Abbrev Number: 6 (DW_TAG_member)
    <4d4>   DW_AT_name        : (indirect string, offset: 0x1c221): DMACHRDR
    <4d8>   DW_AT_decl_file   : 5
    <4d8>   DW_AT_decl_line   : 493
    <4da>   DW_AT_decl_column : 17
    <4da>   DW_AT_type        : <0xcc>
    <4de>   DW_AT_data_member_location: 4172
 <2><4e0>: Abbrev Number: 6 (DW_TAG_member)
    <4e1>   DW_AT_name        : (indirect string, offset: 0x7c299): DMACHTBAR
    <4e5>   DW_AT_decl_file   : 5
    <4e5>   DW_AT_decl_line   : 494
    <4e7>   DW_AT_decl_column : 17
    <4e7>   DW_AT_type        : <0xcc>
    <4eb>   DW_AT_data_member_location: 4176
 <2><4ed>: Abbrev Number: 6 (DW_TAG_member)
    <4ee>   DW_AT_name        : (indirect string, offset: 0x2489c): DMACHRBAR
    <4f2>   DW_AT_decl_file   : 5
    <4f2>   DW_AT_decl_line   : 495
    <4f4>   DW_AT_decl_column : 17
    <4f4>   DW_AT_type        : <0xcc>
    <4f8>   DW_AT_data_member_location: 4180
 <2><4fa>: Abbrev Number: 0
 <1><4fb>: Abbrev Number: 10 (DW_TAG_array_type)
    <4fc>   DW_AT_type        : <0xc0>
    <500>   DW_AT_sibling     : <0x50b>
 <2><504>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <505>   DW_AT_type        : <0x8d>
    <509>   DW_AT_upper_bound : 39
 <2><50a>: Abbrev Number: 0
 <1><50b>: Abbrev Number: 10 (DW_TAG_array_type)
    <50c>   DW_AT_type        : <0xc0>
    <510>   DW_AT_sibling     : <0x51b>
 <2><514>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <515>   DW_AT_type        : <0x8d>
    <519>   DW_AT_upper_bound : 13
 <2><51a>: Abbrev Number: 0
 <1><51b>: Abbrev Number: 10 (DW_TAG_array_type)
    <51c>   DW_AT_type        : <0xc0>
    <520>   DW_AT_sibling     : <0x52b>
 <2><524>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <525>   DW_AT_type        : <0x8d>
    <529>   DW_AT_upper_bound : 4
 <2><52a>: Abbrev Number: 0
 <1><52b>: Abbrev Number: 10 (DW_TAG_array_type)
    <52c>   DW_AT_type        : <0xc0>
    <530>   DW_AT_sibling     : <0x53b>
 <2><534>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <535>   DW_AT_type        : <0x8d>
    <539>   DW_AT_upper_bound : 9
 <2><53a>: Abbrev Number: 0
 <1><53b>: Abbrev Number: 10 (DW_TAG_array_type)
    <53c>   DW_AT_type        : <0xc0>
    <540>   DW_AT_sibling     : <0x54c>
 <2><544>: Abbrev Number: 34 (DW_TAG_subrange_type)
    <545>   DW_AT_type        : <0x8d>
    <549>   DW_AT_upper_bound : 333
 <2><54b>: Abbrev Number: 0
 <1><54c>: Abbrev Number: 10 (DW_TAG_array_type)
    <54d>   DW_AT_type        : <0xc0>
    <551>   DW_AT_sibling     : <0x55d>
 <2><555>: Abbrev Number: 34 (DW_TAG_subrange_type)
    <556>   DW_AT_type        : <0x8d>
    <55a>   DW_AT_upper_bound : 563
 <2><55c>: Abbrev Number: 0
 <1><55d>: Abbrev Number: 14 (DW_TAG_typedef)
    <55e>   DW_AT_name        : (indirect string, offset: 0x11560): ETH_TypeDef
    <562>   DW_AT_decl_file   : 5
    <563>   DW_AT_decl_line   : 496
    <565>   DW_AT_decl_column : 3
    <566>   DW_AT_type        : <0x165>
 <1><56a>: Abbrev Number: 10 (DW_TAG_array_type)
    <56b>   DW_AT_type        : <0xcc>
    <56f>   DW_AT_sibling     : <0x57a>
 <2><573>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <574>   DW_AT_type        : <0x8d>
    <578>   DW_AT_upper_bound : 1
 <2><579>: Abbrev Number: 0
 <1><57a>: Abbrev Number: 18 (DW_TAG_volatile_type)
    <57b>   DW_AT_type        : <0x56a>
 <1><57f>: Abbrev Number: 22 (DW_TAG_structure_type)
    <580>   DW_AT_byte_size   : 40
    <581>   DW_AT_decl_file   : 5
    <582>   DW_AT_decl_line   : 579
    <584>   DW_AT_decl_column : 9
    <584>   DW_AT_sibling     : <0x601>
 <2><588>: Abbrev Number: 2 (DW_TAG_member)
    <589>   DW_AT_name        : (indirect string, offset: 0x1967): MODER
    <58d>   DW_AT_decl_file   : 5
    <58e>   DW_AT_decl_line   : 581
    <590>   DW_AT_decl_column : 17
    <591>   DW_AT_type        : <0xcc>
    <595>   DW_AT_data_member_location: 0
 <2><596>: Abbrev Number: 2 (DW_TAG_member)
    <597>   DW_AT_name        : (indirect string, offset: 0xba5f8): OTYPER
    <59b>   DW_AT_decl_file   : 5
    <59c>   DW_AT_decl_line   : 582
    <59e>   DW_AT_decl_column : 17
    <59f>   DW_AT_type        : <0xcc>
    <5a3>   DW_AT_data_member_location: 4
 <2><5a4>: Abbrev Number: 2 (DW_TAG_member)
    <5a5>   DW_AT_name        : (indirect string, offset: 0xd19b3): OSPEEDR
    <5a9>   DW_AT_decl_file   : 5
    <5aa>   DW_AT_decl_line   : 583
    <5ac>   DW_AT_decl_column : 17
    <5ad>   DW_AT_type        : <0xcc>
    <5b1>   DW_AT_data_member_location: 8
 <2><5b2>: Abbrev Number: 2 (DW_TAG_member)
    <5b3>   DW_AT_name        : (indirect string, offset: 0x9c358): PUPDR
    <5b7>   DW_AT_decl_file   : 5
    <5b8>   DW_AT_decl_line   : 584
    <5ba>   DW_AT_decl_column : 17
    <5bb>   DW_AT_type        : <0xcc>
    <5bf>   DW_AT_data_member_location: 12
 <2><5c0>: Abbrev Number: 12 (DW_TAG_member)
    <5c1>   DW_AT_name        : IDR
    <5c5>   DW_AT_decl_file   : 5
    <5c5>   DW_AT_decl_line   : 585
    <5c7>   DW_AT_decl_column : 17
    <5c7>   DW_AT_type        : <0xcc>
    <5cb>   DW_AT_data_member_location: 16
 <2><5cc>: Abbrev Number: 12 (DW_TAG_member)
    <5cd>   DW_AT_name        : ODR
    <5d1>   DW_AT_decl_file   : 5
    <5d1>   DW_AT_decl_line   : 586
    <5d3>   DW_AT_decl_column : 17
    <5d3>   DW_AT_type        : <0xcc>
    <5d7>   DW_AT_data_member_location: 20
 <2><5d8>: Abbrev Number: 2 (DW_TAG_member)
    <5d9>   DW_AT_name        : (indirect string, offset: 0x3663e): BSRR
    <5dd>   DW_AT_decl_file   : 5
    <5de>   DW_AT_decl_line   : 587
    <5e0>   DW_AT_decl_column : 17
    <5e1>   DW_AT_type        : <0xcc>
    <5e5>   DW_AT_data_member_location: 24
 <2><5e6>: Abbrev Number: 2 (DW_TAG_member)
    <5e7>   DW_AT_name        : (indirect string, offset: 0xcefcd): LCKR
    <5eb>   DW_AT_decl_file   : 5
    <5ec>   DW_AT_decl_line   : 588
    <5ee>   DW_AT_decl_column : 17
    <5ef>   DW_AT_type        : <0xcc>
    <5f3>   DW_AT_data_member_location: 28
 <2><5f4>: Abbrev Number: 12 (DW_TAG_member)
    <5f5>   DW_AT_name        : AFR
    <5f9>   DW_AT_decl_file   : 5
    <5f9>   DW_AT_decl_line   : 589
    <5fb>   DW_AT_decl_column : 17
    <5fb>   DW_AT_type        : <0x57a>
    <5ff>   DW_AT_data_member_location: 32
 <2><600>: Abbrev Number: 0
 <1><601>: Abbrev Number: 14 (DW_TAG_typedef)
    <602>   DW_AT_name        : (indirect string, offset: 0xea076): GPIO_TypeDef
    <606>   DW_AT_decl_file   : 5
    <607>   DW_AT_decl_line   : 590
    <609>   DW_AT_decl_column : 3
    <60a>   DW_AT_type        : <0x57f>
 <1><60e>: Abbrev Number: 10 (DW_TAG_array_type)
    <60f>   DW_AT_type        : <0xc0>
    <613>   DW_AT_sibling     : <0x61e>
 <2><617>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <618>   DW_AT_type        : <0x8d>
    <61c>   DW_AT_upper_bound : 2
 <2><61d>: Abbrev Number: 0
 <1><61e>: Abbrev Number: 22 (DW_TAG_structure_type)
    <61f>   DW_AT_byte_size   : 16
    <620>   DW_AT_decl_file   : 5
    <621>   DW_AT_decl_line   : 690
    <623>   DW_AT_decl_column : 9
    <623>   DW_AT_sibling     : <0x65c>
 <2><627>: Abbrev Number: 12 (DW_TAG_member)
    <628>   DW_AT_name        : CR1
    <62c>   DW_AT_decl_file   : 5
    <62c>   DW_AT_decl_line   : 692
    <62e>   DW_AT_decl_column : 17
    <62e>   DW_AT_type        : <0xcc>
    <632>   DW_AT_data_member_location: 0
 <2><633>: Abbrev Number: 2 (DW_TAG_member)
    <634>   DW_AT_name        : (indirect string, offset: 0x622e2): CSR1
    <638>   DW_AT_decl_file   : 5
    <639>   DW_AT_decl_line   : 693
    <63b>   DW_AT_decl_column : 17
    <63c>   DW_AT_type        : <0xcc>
    <640>   DW_AT_data_member_location: 4
 <2><641>: Abbrev Number: 12 (DW_TAG_member)
    <642>   DW_AT_name        : CR2
    <646>   DW_AT_decl_file   : 5
    <646>   DW_AT_decl_line   : 694
    <648>   DW_AT_decl_column : 17
    <648>   DW_AT_type        : <0xcc>
    <64c>   DW_AT_data_member_location: 8
 <2><64d>: Abbrev Number: 2 (DW_TAG_member)
    <64e>   DW_AT_name        : (indirect string, offset: 0x622e7): CSR2
    <652>   DW_AT_decl_file   : 5
    <653>   DW_AT_decl_line   : 695
    <655>   DW_AT_decl_column : 17
    <656>   DW_AT_type        : <0xcc>
    <65a>   DW_AT_data_member_location: 12
 <2><65b>: Abbrev Number: 0
 <1><65c>: Abbrev Number: 14 (DW_TAG_typedef)
    <65d>   DW_AT_name        : (indirect string, offset: 0xae31a): PWR_TypeDef
    <661>   DW_AT_decl_file   : 5
    <662>   DW_AT_decl_line   : 696
    <664>   DW_AT_decl_column : 3
    <665>   DW_AT_type        : <0x61e>
 <1><669>: Abbrev Number: 22 (DW_TAG_structure_type)
    <66a>   DW_AT_byte_size   : 148
    <66b>   DW_AT_decl_file   : 5
    <66c>   DW_AT_decl_line   : 703
    <66e>   DW_AT_decl_column : 9
    <66e>   DW_AT_sibling     : <0x83a>
 <2><672>: Abbrev Number: 12 (DW_TAG_member)
    <673>   DW_AT_name        : CR
    <676>   DW_AT_decl_file   : 5
    <676>   DW_AT_decl_line   : 705
    <678>   DW_AT_decl_column : 17
    <678>   DW_AT_type        : <0xcc>
    <67c>   DW_AT_data_member_location: 0
 <2><67d>: Abbrev Number: 2 (DW_TAG_member)
    <67e>   DW_AT_name        : (indirect string, offset: 0xa91d3): PLLCFGR
    <682>   DW_AT_decl_file   : 5
    <683>   DW_AT_decl_line   : 706
    <685>   DW_AT_decl_column : 17
    <686>   DW_AT_type        : <0xcc>
    <68a>   DW_AT_data_member_location: 4
 <2><68b>: Abbrev Number: 2 (DW_TAG_member)
    <68c>   DW_AT_name        : (indirect string, offset: 0x42caf): CFGR
    <690>   DW_AT_decl_file   : 5
    <691>   DW_AT_decl_line   : 707
    <693>   DW_AT_decl_column : 17
    <694>   DW_AT_type        : <0xcc>
    <698>   DW_AT_data_member_location: 8
 <2><699>: Abbrev Number: 12 (DW_TAG_member)
    <69a>   DW_AT_name        : CIR
    <69e>   DW_AT_decl_file   : 5
    <69e>   DW_AT_decl_line   : 708
    <6a0>   DW_AT_decl_column : 17
    <6a0>   DW_AT_type        : <0xcc>
    <6a4>   DW_AT_data_member_location: 12
 <2><6a5>: Abbrev Number: 2 (DW_TAG_member)
    <6a6>   DW_AT_name        : (indirect string, offset: 0xbfe19): AHB1RSTR
    <6aa>   DW_AT_decl_file   : 5
    <6ab>   DW_AT_decl_line   : 709
    <6ad>   DW_AT_decl_column : 17
    <6ae>   DW_AT_type        : <0xcc>
    <6b2>   DW_AT_data_member_location: 16
 <2><6b3>: Abbrev Number: 2 (DW_TAG_member)
    <6b4>   DW_AT_name        : (indirect string, offset: 0x1c09a): AHB2RSTR
    <6b8>   DW_AT_decl_file   : 5
    <6b9>   DW_AT_decl_line   : 710
    <6bb>   DW_AT_decl_column : 17
    <6bc>   DW_AT_type        : <0xcc>
    <6c0>   DW_AT_data_member_location: 20
 <2><6c1>: Abbrev Number: 2 (DW_TAG_member)
    <6c2>   DW_AT_name        : (indirect string, offset: 0x68c09): AHB3RSTR
    <6c6>   DW_AT_decl_file   : 5
    <6c7>   DW_AT_decl_line   : 711
    <6c9>   DW_AT_decl_column : 17
    <6ca>   DW_AT_type        : <0xcc>
    <6ce>   DW_AT_data_member_location: 24
 <2><6cf>: Abbrev Number: 2 (DW_TAG_member)
    <6d0>   DW_AT_name        : (indirect string, offset: 0xe37ca): RESERVED0
    <6d4>   DW_AT_decl_file   : 5
    <6d5>   DW_AT_decl_line   : 712
    <6d7>   DW_AT_decl_column : 17
    <6d8>   DW_AT_type        : <0xc0>
    <6dc>   DW_AT_data_member_location: 28
 <2><6dd>: Abbrev Number: 2 (DW_TAG_member)
    <6de>   DW_AT_name        : (indirect string, offset: 0x1bbc1): APB1RSTR
    <6e2>   DW_AT_decl_file   : 5
    <6e3>   DW_AT_decl_line   : 713
    <6e5>   DW_AT_decl_column : 17
    <6e6>   DW_AT_type        : <0xcc>
    <6ea>   DW_AT_data_member_location: 32
 <2><6eb>: Abbrev Number: 2 (DW_TAG_member)
    <6ec>   DW_AT_name        : (indirect string, offset: 0x684f6): APB2RSTR
    <6f0>   DW_AT_decl_file   : 5
    <6f1>   DW_AT_decl_line   : 714
    <6f3>   DW_AT_decl_column : 17
    <6f4>   DW_AT_type        : <0xcc>
    <6f8>   DW_AT_data_member_location: 36
 <2><6f9>: Abbrev Number: 2 (DW_TAG_member)
    <6fa>   DW_AT_name        : (indirect string, offset: 0xe37d4): RESERVED1
    <6fe>   DW_AT_decl_file   : 5
    <6ff>   DW_AT_decl_line   : 715
    <701>   DW_AT_decl_column : 17
    <702>   DW_AT_type        : <0xd1>
    <706>   DW_AT_data_member_location: 40
 <2><707>: Abbrev Number: 2 (DW_TAG_member)
    <708>   DW_AT_name        : (indirect string, offset: 0x13c94): AHB1ENR
    <70c>   DW_AT_decl_file   : 5
    <70d>   DW_AT_decl_line   : 716
    <70f>   DW_AT_decl_column : 17
    <710>   DW_AT_type        : <0xcc>
    <714>   DW_AT_data_member_location: 48
 <2><715>: Abbrev Number: 2 (DW_TAG_member)
    <716>   DW_AT_name        : (indirect string, offset: 0x3ffe5): AHB2ENR
    <71a>   DW_AT_decl_file   : 5
    <71b>   DW_AT_decl_line   : 717
    <71d>   DW_AT_decl_column : 17
    <71e>   DW_AT_type        : <0xcc>
    <722>   DW_AT_data_member_location: 52
 <2><723>: Abbrev Number: 2 (DW_TAG_member)
    <724>   DW_AT_name        : (indirect string, offset: 0x6bae8): AHB3ENR
    <728>   DW_AT_decl_file   : 5
    <729>   DW_AT_decl_line   : 718
    <72b>   DW_AT_decl_column : 17
    <72c>   DW_AT_type        : <0xcc>
    <730>   DW_AT_data_member_location: 56
 <2><731>: Abbrev Number: 2 (DW_TAG_member)
    <732>   DW_AT_name        : (indirect string, offset: 0xe37de): RESERVED2
    <736>   DW_AT_decl_file   : 5
    <737>   DW_AT_decl_line   : 719
    <739>   DW_AT_decl_column : 17
    <73a>   DW_AT_type        : <0xc0>
    <73e>   DW_AT_data_member_location: 60
 <2><73f>: Abbrev Number: 2 (DW_TAG_member)
    <740>   DW_AT_name        : (indirect string, offset: 0x89c41): APB1ENR
    <744>   DW_AT_decl_file   : 5
    <745>   DW_AT_decl_line   : 720
    <747>   DW_AT_decl_column : 17
    <748>   DW_AT_type        : <0xcc>
    <74c>   DW_AT_data_member_location: 64
 <2><74d>: Abbrev Number: 2 (DW_TAG_member)
    <74e>   DW_AT_name        : (indirect string, offset: 0x1d217): APB2ENR
    <752>   DW_AT_decl_file   : 5
    <753>   DW_AT_decl_line   : 721
    <755>   DW_AT_decl_column : 17
    <756>   DW_AT_type        : <0xcc>
    <75a>   DW_AT_data_member_location: 68
 <2><75b>: Abbrev Number: 2 (DW_TAG_member)
    <75c>   DW_AT_name        : (indirect string, offset: 0xe37e8): RESERVED3
    <760>   DW_AT_decl_file   : 5
    <761>   DW_AT_decl_line   : 722
    <763>   DW_AT_decl_column : 17
    <764>   DW_AT_type        : <0xd1>
    <768>   DW_AT_data_member_location: 72
 <2><769>: Abbrev Number: 2 (DW_TAG_member)
    <76a>   DW_AT_name        : (indirect string, offset: 0xc4701): AHB1LPENR
    <76e>   DW_AT_decl_file   : 5
    <76f>   DW_AT_decl_line   : 723
    <771>   DW_AT_decl_column : 17
    <772>   DW_AT_type        : <0xcc>
    <776>   DW_AT_data_member_location: 80
 <2><777>: Abbrev Number: 2 (DW_TAG_member)
    <778>   DW_AT_name        : (indirect string, offset: 0x360e9): AHB2LPENR
    <77c>   DW_AT_decl_file   : 5
    <77d>   DW_AT_decl_line   : 724
    <77f>   DW_AT_decl_column : 17
    <780>   DW_AT_type        : <0xcc>
    <784>   DW_AT_data_member_location: 84
 <2><785>: Abbrev Number: 2 (DW_TAG_member)
    <786>   DW_AT_name        : (indirect string, offset: 0xa3a85): AHB3LPENR
    <78a>   DW_AT_decl_file   : 5
    <78b>   DW_AT_decl_line   : 725
    <78d>   DW_AT_decl_column : 17
    <78e>   DW_AT_type        : <0xcc>
    <792>   DW_AT_data_member_location: 88
 <2><793>: Abbrev Number: 2 (DW_TAG_member)
    <794>   DW_AT_name        : (indirect string, offset: 0xe37f2): RESERVED4
    <798>   DW_AT_decl_file   : 5
    <799>   DW_AT_decl_line   : 726
    <79b>   DW_AT_decl_column : 17
    <79c>   DW_AT_type        : <0xc0>
    <7a0>   DW_AT_data_member_location: 92
 <2><7a1>: Abbrev Number: 2 (DW_TAG_member)
    <7a2>   DW_AT_name        : (indirect string, offset: 0xca41b): APB1LPENR
    <7a6>   DW_AT_decl_file   : 5
    <7a7>   DW_AT_decl_line   : 727
    <7a9>   DW_AT_decl_column : 17
    <7aa>   DW_AT_type        : <0xcc>
    <7ae>   DW_AT_data_member_location: 96
 <2><7af>: Abbrev Number: 2 (DW_TAG_member)
    <7b0>   DW_AT_name        : (indirect string, offset: 0x28413): APB2LPENR
    <7b4>   DW_AT_decl_file   : 5
    <7b5>   DW_AT_decl_line   : 728
    <7b7>   DW_AT_decl_column : 17
    <7b8>   DW_AT_type        : <0xcc>
    <7bc>   DW_AT_data_member_location: 100
 <2><7bd>: Abbrev Number: 2 (DW_TAG_member)
    <7be>   DW_AT_name        : (indirect string, offset: 0xe37fc): RESERVED5
    <7c2>   DW_AT_decl_file   : 5
    <7c3>   DW_AT_decl_line   : 729
    <7c5>   DW_AT_decl_column : 17
    <7c6>   DW_AT_type        : <0xd1>
    <7ca>   DW_AT_data_member_location: 104
 <2><7cb>: Abbrev Number: 2 (DW_TAG_member)
    <7cc>   DW_AT_name        : (indirect string, offset: 0x21d05): BDCR
    <7d0>   DW_AT_decl_file   : 5
    <7d1>   DW_AT_decl_line   : 730
    <7d3>   DW_AT_decl_column : 17
    <7d4>   DW_AT_type        : <0xcc>
    <7d8>   DW_AT_data_member_location: 112
 <2><7d9>: Abbrev Number: 12 (DW_TAG_member)
    <7da>   DW_AT_name        : CSR
    <7de>   DW_AT_decl_file   : 5
    <7de>   DW_AT_decl_line   : 731
    <7e0>   DW_AT_decl_column : 17
    <7e0>   DW_AT_type        : <0xcc>
    <7e4>   DW_AT_data_member_location: 116
 <2><7e5>: Abbrev Number: 2 (DW_TAG_member)
    <7e6>   DW_AT_name        : (indirect string, offset: 0x8e895): RESERVED6
    <7ea>   DW_AT_decl_file   : 5
    <7eb>   DW_AT_decl_line   : 732
    <7ed>   DW_AT_decl_column : 17
    <7ee>   DW_AT_type        : <0xd1>
    <7f2>   DW_AT_data_member_location: 120
 <2><7f3>: Abbrev Number: 2 (DW_TAG_member)
    <7f4>   DW_AT_name        : (indirect string, offset: 0x7efcb): SSCGR
    <7f8>   DW_AT_decl_file   : 5
    <7f9>   DW_AT_decl_line   : 733
    <7fb>   DW_AT_decl_column : 17
    <7fc>   DW_AT_type        : <0xcc>
    <800>   DW_AT_data_member_location: 128
 <2><801>: Abbrev Number: 2 (DW_TAG_member)
    <802>   DW_AT_name        : (indirect string, offset: 0x4faf5): PLLI2SCFGR
    <806>   DW_AT_decl_file   : 5
    <807>   DW_AT_decl_line   : 734
    <809>   DW_AT_decl_column : 17
    <80a>   DW_AT_type        : <0xcc>
    <80e>   DW_AT_data_member_location: 132
 <2><80f>: Abbrev Number: 2 (DW_TAG_member)
    <810>   DW_AT_name        : (indirect string, offset: 0x42ca9): PLLSAICFGR
    <814>   DW_AT_decl_file   : 5
    <815>   DW_AT_decl_line   : 735
    <817>   DW_AT_decl_column : 17
    <818>   DW_AT_type        : <0xcc>
    <81c>   DW_AT_data_member_location: 136
 <2><81d>: Abbrev Number: 2 (DW_TAG_member)
    <81e>   DW_AT_name        : (indirect string, offset: 0x79750): DCKCFGR1
    <822>   DW_AT_decl_file   : 5
    <823>   DW_AT_decl_line   : 736
    <825>   DW_AT_decl_column : 17
    <826>   DW_AT_type        : <0xcc>
    <82a>   DW_AT_data_member_location: 140
 <2><82b>: Abbrev Number: 2 (DW_TAG_member)
    <82c>   DW_AT_name        : (indirect string, offset: 0xa7b8f): DCKCFGR2
    <830>   DW_AT_decl_file   : 5
    <831>   DW_AT_decl_line   : 737
    <833>   DW_AT_decl_column : 17
    <834>   DW_AT_type        : <0xcc>
    <838>   DW_AT_data_member_location: 144
 <2><839>: Abbrev Number: 0
 <1><83a>: Abbrev Number: 14 (DW_TAG_typedef)
    <83b>   DW_AT_name        : (indirect string, offset: 0x6f011): RCC_TypeDef
    <83f>   DW_AT_decl_file   : 5
    <840>   DW_AT_decl_line   : 739
    <842>   DW_AT_decl_column : 3
    <843>   DW_AT_type        : <0x669>
 <1><847>: Abbrev Number: 22 (DW_TAG_structure_type)
    <848>   DW_AT_byte_size   : 44
    <849>   DW_AT_decl_file   : 5
    <84a>   DW_AT_decl_line   : 957
    <84c>   DW_AT_decl_column : 9
    <84c>   DW_AT_sibling     : <0x8d9>
 <2><850>: Abbrev Number: 12 (DW_TAG_member)
    <851>   DW_AT_name        : CR1
    <855>   DW_AT_decl_file   : 5
    <855>   DW_AT_decl_line   : 959
    <857>   DW_AT_decl_column : 17
    <857>   DW_AT_type        : <0xcc>
    <85b>   DW_AT_data_member_location: 0
 <2><85c>: Abbrev Number: 12 (DW_TAG_member)
    <85d>   DW_AT_name        : CR2
    <861>   DW_AT_decl_file   : 5
    <861>   DW_AT_decl_line   : 960
    <863>   DW_AT_decl_column : 17
    <863>   DW_AT_type        : <0xcc>
    <867>   DW_AT_data_member_location: 4
 <2><868>: Abbrev Number: 12 (DW_TAG_member)
    <869>   DW_AT_name        : CR3
    <86d>   DW_AT_decl_file   : 5
    <86d>   DW_AT_decl_line   : 961
    <86f>   DW_AT_decl_column : 17
    <86f>   DW_AT_type        : <0xcc>
    <873>   DW_AT_data_member_location: 8
 <2><874>: Abbrev Number: 12 (DW_TAG_member)
    <875>   DW_AT_name        : BRR
    <879>   DW_AT_decl_file   : 5
    <879>   DW_AT_decl_line   : 962
    <87b>   DW_AT_decl_column : 17
    <87b>   DW_AT_type        : <0xcc>
    <87f>   DW_AT_data_member_location: 12
 <2><880>: Abbrev Number: 2 (DW_TAG_member)
    <881>   DW_AT_name        : (indirect string, offset: 0x42ef0): GTPR
    <885>   DW_AT_decl_file   : 5
    <886>   DW_AT_decl_line   : 963
    <888>   DW_AT_decl_column : 17
    <889>   DW_AT_type        : <0xcc>
    <88d>   DW_AT_data_member_location: 16
 <2><88e>: Abbrev Number: 2 (DW_TAG_member)
    <88f>   DW_AT_name        : (indirect string, offset: 0xd45e1): RTOR
    <893>   DW_AT_decl_file   : 5
    <894>   DW_AT_decl_line   : 964
    <896>   DW_AT_decl_column : 17
    <897>   DW_AT_type        : <0xcc>
    <89b>   DW_AT_data_member_location: 20
 <2><89c>: Abbrev Number: 12 (DW_TAG_member)
    <89d>   DW_AT_name        : RQR
    <8a1>   DW_AT_decl_file   : 5
    <8a1>   DW_AT_decl_line   : 965
    <8a3>   DW_AT_decl_column : 17
    <8a3>   DW_AT_type        : <0xcc>
    <8a7>   DW_AT_data_member_location: 24
 <2><8a8>: Abbrev Number: 12 (DW_TAG_member)
    <8a9>   DW_AT_name        : ISR
    <8ad>   DW_AT_decl_file   : 5
    <8ad>   DW_AT_decl_line   : 966
    <8af>   DW_AT_decl_column : 17
    <8af>   DW_AT_type        : <0xcc>
    <8b3>   DW_AT_data_member_location: 28
 <2><8b4>: Abbrev Number: 12 (DW_TAG_member)
    <8b5>   DW_AT_name        : ICR
    <8b9>   DW_AT_decl_file   : 5
    <8b9>   DW_AT_decl_line   : 967
    <8bb>   DW_AT_decl_column : 17
    <8bb>   DW_AT_type        : <0xcc>
    <8bf>   DW_AT_data_member_location: 32
 <2><8c0>: Abbrev Number: 12 (DW_TAG_member)
    <8c1>   DW_AT_name        : RDR
    <8c5>   DW_AT_decl_file   : 5
    <8c5>   DW_AT_decl_line   : 968
    <8c7>   DW_AT_decl_column : 17
    <8c7>   DW_AT_type        : <0xcc>
    <8cb>   DW_AT_data_member_location: 36
 <2><8cc>: Abbrev Number: 12 (DW_TAG_member)
    <8cd>   DW_AT_name        : TDR
    <8d1>   DW_AT_decl_file   : 5
    <8d1>   DW_AT_decl_line   : 969
    <8d3>   DW_AT_decl_column : 17
    <8d3>   DW_AT_type        : <0xcc>
    <8d7>   DW_AT_data_member_location: 40
 <2><8d8>: Abbrev Number: 0
 <1><8d9>: Abbrev Number: 14 (DW_TAG_typedef)
    <8da>   DW_AT_name        : (indirect string, offset: 0x803cc): USART_TypeDef
    <8de>   DW_AT_decl_file   : 5
    <8df>   DW_AT_decl_line   : 970
    <8e1>   DW_AT_decl_column : 3
    <8e2>   DW_AT_type        : <0x847>
 <1><8e6>: Abbrev Number: 33 (DW_TAG_structure_type)
    <8e7>   DW_AT_byte_size   : 320
    <8e9>   DW_AT_decl_file   : 5
    <8e9>   DW_AT_decl_line   : 1003
    <8eb>   DW_AT_decl_column : 9
    <8eb>   DW_AT_sibling     : <0xa3c>
 <2><8ef>: Abbrev Number: 2 (DW_TAG_member)
    <8f0>   DW_AT_name        : (indirect string, offset: 0x1a8c5): GOTGCTL
    <8f4>   DW_AT_decl_file   : 5
    <8f5>   DW_AT_decl_line   : 1005
    <8f7>   DW_AT_decl_column : 16
    <8f8>   DW_AT_type        : <0xcc>
    <8fc>   DW_AT_data_member_location: 0
 <2><8fd>: Abbrev Number: 2 (DW_TAG_member)
    <8fe>   DW_AT_name        : (indirect string, offset: 0xb0708): GOTGINT
    <902>   DW_AT_decl_file   : 5
    <903>   DW_AT_decl_line   : 1006
    <905>   DW_AT_decl_column : 17
    <906>   DW_AT_type        : <0xcc>
    <90a>   DW_AT_data_member_location: 4
 <2><90b>: Abbrev Number: 2 (DW_TAG_member)
    <90c>   DW_AT_name        : (indirect string, offset: 0x3871e): GAHBCFG
    <910>   DW_AT_decl_file   : 5
    <911>   DW_AT_decl_line   : 1007
    <913>   DW_AT_decl_column : 17
    <914>   DW_AT_type        : <0xcc>
    <918>   DW_AT_data_member_location: 8
 <2><919>: Abbrev Number: 2 (DW_TAG_member)
    <91a>   DW_AT_name        : (indirect string, offset: 0x83d12): GUSBCFG
    <91e>   DW_AT_decl_file   : 5
    <91f>   DW_AT_decl_line   : 1008
    <921>   DW_AT_decl_column : 17
    <922>   DW_AT_type        : <0xcc>
    <926>   DW_AT_data_member_location: 12
 <2><927>: Abbrev Number: 2 (DW_TAG_member)
    <928>   DW_AT_name        : (indirect string, offset: 0x89f8a): GRSTCTL
    <92c>   DW_AT_decl_file   : 5
    <92d>   DW_AT_decl_line   : 1009
    <92f>   DW_AT_decl_column : 17
    <930>   DW_AT_type        : <0xcc>
    <934>   DW_AT_data_member_location: 16
 <2><935>: Abbrev Number: 2 (DW_TAG_member)
    <936>   DW_AT_name        : (indirect string, offset: 0xd2085): GINTSTS
    <93a>   DW_AT_decl_file   : 5
    <93b>   DW_AT_decl_line   : 1010
    <93d>   DW_AT_decl_column : 17
    <93e>   DW_AT_type        : <0xcc>
    <942>   DW_AT_data_member_location: 20
 <2><943>: Abbrev Number: 2 (DW_TAG_member)
    <944>   DW_AT_name        : (indirect string, offset: 0x35464): GINTMSK
    <948>   DW_AT_decl_file   : 5
    <949>   DW_AT_decl_line   : 1011
    <94b>   DW_AT_decl_column : 17
    <94c>   DW_AT_type        : <0xcc>
    <950>   DW_AT_data_member_location: 24
 <2><951>: Abbrev Number: 2 (DW_TAG_member)
    <952>   DW_AT_name        : (indirect string, offset: 0x4d0e5): GRXSTSR
    <956>   DW_AT_decl_file   : 5
    <957>   DW_AT_decl_line   : 1012
    <959>   DW_AT_decl_column : 17
    <95a>   DW_AT_type        : <0xcc>
    <95e>   DW_AT_data_member_location: 28
 <2><95f>: Abbrev Number: 2 (DW_TAG_member)
    <960>   DW_AT_name        : (indirect string, offset: 0x4d0c3): GRXSTSP
    <964>   DW_AT_decl_file   : 5
    <965>   DW_AT_decl_line   : 1013
    <967>   DW_AT_decl_column : 17
    <968>   DW_AT_type        : <0xcc>
    <96c>   DW_AT_data_member_location: 32
 <2><96d>: Abbrev Number: 2 (DW_TAG_member)
    <96e>   DW_AT_name        : (indirect string, offset: 0xba15b): GRXFSIZ
    <972>   DW_AT_decl_file   : 5
    <973>   DW_AT_decl_line   : 1014
    <975>   DW_AT_decl_column : 17
    <976>   DW_AT_type        : <0xcc>
    <97a>   DW_AT_data_member_location: 36
 <2><97b>: Abbrev Number: 2 (DW_TAG_member)
    <97c>   DW_AT_name        : (indirect string, offset: 0xcd970): DIEPTXF0_HNPTXFSIZ
    <980>   DW_AT_decl_file   : 5
    <981>   DW_AT_decl_line   : 1015
    <983>   DW_AT_decl_column : 17
    <984>   DW_AT_type        : <0xcc>
    <988>   DW_AT_data_member_location: 40
 <2><989>: Abbrev Number: 2 (DW_TAG_member)
    <98a>   DW_AT_name        : (indirect string, offset: 0x92f96): HNPTXSTS
    <98e>   DW_AT_decl_file   : 5
    <98f>   DW_AT_decl_line   : 1016
    <991>   DW_AT_decl_column : 17
    <992>   DW_AT_type        : <0xcc>
    <996>   DW_AT_data_member_location: 44
 <2><997>: Abbrev Number: 2 (DW_TAG_member)
    <998>   DW_AT_name        : (indirect string, offset: 0x49370): Reserved30
    <99c>   DW_AT_decl_file   : 5
    <99d>   DW_AT_decl_line   : 1017
    <99f>   DW_AT_decl_column : 12
    <9a0>   DW_AT_type        : <0xd1>
    <9a4>   DW_AT_data_member_location: 48
 <2><9a5>: Abbrev Number: 2 (DW_TAG_member)
    <9a6>   DW_AT_name        : (indirect string, offset: 0xb3476): GCCFG
    <9aa>   DW_AT_decl_file   : 5
    <9ab>   DW_AT_decl_line   : 1018
    <9ad>   DW_AT_decl_column : 17
    <9ae>   DW_AT_type        : <0xcc>
    <9b2>   DW_AT_data_member_location: 56
 <2><9b3>: Abbrev Number: 12 (DW_TAG_member)
    <9b4>   DW_AT_name        : CID
    <9b8>   DW_AT_decl_file   : 5
    <9b8>   DW_AT_decl_line   : 1019
    <9ba>   DW_AT_decl_column : 17
    <9ba>   DW_AT_type        : <0xcc>
    <9be>   DW_AT_data_member_location: 60
 <2><9bf>: Abbrev Number: 2 (DW_TAG_member)
    <9c0>   DW_AT_name        : (indirect string, offset: 0x52fbb): Reserved5
    <9c4>   DW_AT_decl_file   : 5
    <9c5>   DW_AT_decl_line   : 1020
    <9c7>   DW_AT_decl_column : 13
    <9c8>   DW_AT_type        : <0x60e>
    <9cc>   DW_AT_data_member_location: 64
 <2><9cd>: Abbrev Number: 2 (DW_TAG_member)
    <9ce>   DW_AT_name        : (indirect string, offset: 0xacd53): GHWCFG3
    <9d2>   DW_AT_decl_file   : 5
    <9d3>   DW_AT_decl_line   : 1021
    <9d5>   DW_AT_decl_column : 17
    <9d6>   DW_AT_type        : <0xcc>
    <9da>   DW_AT_data_member_location: 76
 <2><9db>: Abbrev Number: 2 (DW_TAG_member)
    <9dc>   DW_AT_name        : (indirect string, offset: 0x52fc5): Reserved6
    <9e0>   DW_AT_decl_file   : 5
    <9e1>   DW_AT_decl_line   : 1022
    <9e3>   DW_AT_decl_column : 13
    <9e4>   DW_AT_type        : <0xc0>
    <9e8>   DW_AT_data_member_location: 80
 <2><9e9>: Abbrev Number: 2 (DW_TAG_member)
    <9ea>   DW_AT_name        : (indirect string, offset: 0x5a895): GLPMCFG
    <9ee>   DW_AT_decl_file   : 5
    <9ef>   DW_AT_decl_line   : 1023
    <9f1>   DW_AT_decl_column : 17
    <9f2>   DW_AT_type        : <0xcc>
    <9f6>   DW_AT_data_member_location: 84
 <2><9f7>: Abbrev Number: 2 (DW_TAG_member)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x52fcf): Reserved7
    <9fc>   DW_AT_decl_file   : 5
    <9fd>   DW_AT_decl_line   : 1024
    <9ff>   DW_AT_decl_column : 13
    <a00>   DW_AT_type        : <0xc0>
    <a04>   DW_AT_data_member_location: 88
 <2><a05>: Abbrev Number: 2 (DW_TAG_member)
    <a06>   DW_AT_name        : (indirect string, offset: 0x4e159): GDFIFOCFG
    <a0a>   DW_AT_decl_file   : 5
    <a0b>   DW_AT_decl_line   : 1025
    <a0d>   DW_AT_decl_column : 17
    <a0e>   DW_AT_type        : <0xcc>
    <a12>   DW_AT_data_member_location: 92
 <2><a13>: Abbrev Number: 2 (DW_TAG_member)
    <a14>   DW_AT_name        : (indirect string, offset: 0x49ae5): Reserved43
    <a18>   DW_AT_decl_file   : 5
    <a19>   DW_AT_decl_line   : 1026
    <a1b>   DW_AT_decl_column : 13
    <a1c>   DW_AT_type        : <0x4fb>
    <a20>   DW_AT_data_member_location: 96
 <2><a21>: Abbrev Number: 6 (DW_TAG_member)
    <a22>   DW_AT_name        : (indirect string, offset: 0x2987a): HPTXFSIZ
    <a26>   DW_AT_decl_file   : 5
    <a26>   DW_AT_decl_line   : 1027
    <a28>   DW_AT_decl_column : 17
    <a28>   DW_AT_type        : <0xcc>
    <a2c>   DW_AT_data_member_location: 256
 <2><a2e>: Abbrev Number: 6 (DW_TAG_member)
    <a2f>   DW_AT_name        : (indirect string, offset: 0x752e1): DIEPTXF
    <a33>   DW_AT_decl_file   : 5
    <a33>   DW_AT_decl_line   : 1028
    <a35>   DW_AT_decl_column : 17
    <a35>   DW_AT_type        : <0xa4c>
    <a39>   DW_AT_data_member_location: 260
 <2><a3b>: Abbrev Number: 0
 <1><a3c>: Abbrev Number: 10 (DW_TAG_array_type)
    <a3d>   DW_AT_type        : <0xcc>
    <a41>   DW_AT_sibling     : <0xa4c>
 <2><a45>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <a46>   DW_AT_type        : <0x8d>
    <a4a>   DW_AT_upper_bound : 14
 <2><a4b>: Abbrev Number: 0
 <1><a4c>: Abbrev Number: 18 (DW_TAG_volatile_type)
    <a4d>   DW_AT_type        : <0xa3c>
 <1><a51>: Abbrev Number: 14 (DW_TAG_typedef)
    <a52>   DW_AT_name        : (indirect string, offset: 0xb0e9c): USB_OTG_GlobalTypeDef
    <a56>   DW_AT_decl_file   : 5
    <a57>   DW_AT_decl_line   : 1029
    <a59>   DW_AT_decl_column : 3
    <a5a>   DW_AT_type        : <0x8e6>
 <1><a5e>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <a5f>   DW_AT_encoding    : 7	(unsigned)
    <a60>   DW_AT_byte_size   : 1
    <a61>   DW_AT_type        : <0x3d>
    <a65>   DW_AT_decl_file   : 7
    <a66>   DW_AT_decl_line   : 162
    <a67>   DW_AT_decl_column : 1
    <a68>   DW_AT_sibling     : <0xa79>
 <2><a6c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a6d>   DW_AT_name        : (indirect string, offset: 0x2d705): DISABLE
    <a71>   DW_AT_const_value : 0
 <2><a72>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a73>   DW_AT_name        : (indirect string, offset: 0x7feca): ENABLE
    <a77>   DW_AT_const_value : 1
 <2><a78>: Abbrev Number: 0
 <1><a79>: Abbrev Number: 5 (DW_TAG_typedef)
    <a7a>   DW_AT_name        : (indirect string, offset: 0xa44b): size_t
    <a7e>   DW_AT_decl_file   : 6
    <a7f>   DW_AT_decl_line   : 209
    <a80>   DW_AT_decl_column : 23
    <a81>   DW_AT_type        : <0x8d>
 <1><a85>: Abbrev Number: 17 (DW_TAG_base_type)
    <a86>   DW_AT_byte_size   : 8
    <a87>   DW_AT_encoding    : 4	(float)
    <a88>   DW_AT_name        : (indirect string, offset: 0x16802): long double
 <1><a8c>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <a8d>   DW_AT_encoding    : 7	(unsigned)
    <a8e>   DW_AT_byte_size   : 1
    <a8f>   DW_AT_type        : <0x3d>
    <a93>   DW_AT_decl_file   : 8
    <a94>   DW_AT_decl_line   : 39
    <a95>   DW_AT_decl_column : 1
    <a96>   DW_AT_sibling     : <0xab3>
 <2><a9a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a9b>   DW_AT_name        : (indirect string, offset: 0x50f0d): HAL_OK
    <a9f>   DW_AT_const_value : 0
 <2><aa0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <aa1>   DW_AT_name        : (indirect string, offset: 0x953cc): HAL_ERROR
    <aa5>   DW_AT_const_value : 1
 <2><aa6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <aa7>   DW_AT_name        : (indirect string, offset: 0x2a8b5): HAL_BUSY
    <aab>   DW_AT_const_value : 2
 <2><aac>: Abbrev Number: 3 (DW_TAG_enumerator)
    <aad>   DW_AT_name        : (indirect string, offset: 0x46cb4): HAL_TIMEOUT
    <ab1>   DW_AT_const_value : 3
 <2><ab2>: Abbrev Number: 0
 <1><ab3>: Abbrev Number: 5 (DW_TAG_typedef)
    <ab4>   DW_AT_name        : (indirect string, offset: 0x2a4b): HAL_StatusTypeDef
    <ab8>   DW_AT_decl_file   : 8
    <ab9>   DW_AT_decl_line   : 44
    <aba>   DW_AT_decl_column : 3
    <abb>   DW_AT_type        : <0xa8c>
 <1><abf>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <ac0>   DW_AT_encoding    : 7	(unsigned)
    <ac1>   DW_AT_byte_size   : 1
    <ac2>   DW_AT_type        : <0x3d>
    <ac6>   DW_AT_decl_file   : 8
    <ac7>   DW_AT_decl_line   : 50
    <ac8>   DW_AT_decl_column : 1
    <ac9>   DW_AT_sibling     : <0xada>
 <2><acd>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ace>   DW_AT_name        : (indirect string, offset: 0xb232d): HAL_UNLOCKED
    <ad2>   DW_AT_const_value : 0
 <2><ad3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ad4>   DW_AT_name        : (indirect string, offset: 0xf0880): HAL_LOCKED
    <ad8>   DW_AT_const_value : 1
 <2><ad9>: Abbrev Number: 0
 <1><ada>: Abbrev Number: 5 (DW_TAG_typedef)
    <adb>   DW_AT_name        : (indirect string, offset: 0x8d475): HAL_LockTypeDef
    <adf>   DW_AT_decl_file   : 8
    <ae0>   DW_AT_decl_line   : 53
    <ae1>   DW_AT_decl_column : 3
    <ae2>   DW_AT_type        : <0xabf>
 <1><ae6>: Abbrev Number: 13 (DW_TAG_structure_type)
    <ae7>   DW_AT_byte_size   : 24
    <ae8>   DW_AT_decl_file   : 9
    <ae9>   DW_AT_decl_line   : 45
    <aea>   DW_AT_decl_column : 9
    <aea>   DW_AT_sibling     : <0xb3d>
 <2><aee>: Abbrev Number: 1 (DW_TAG_member)
    <aef>   DW_AT_name        : (indirect string, offset: 0xa266c): PLLState
    <af3>   DW_AT_decl_file   : 9
    <af4>   DW_AT_decl_line   : 47
    <af5>   DW_AT_decl_column : 12
    <af6>   DW_AT_type        : <0xc0>
    <afa>   DW_AT_data_member_location: 0
 <2><afb>: Abbrev Number: 1 (DW_TAG_member)
    <afc>   DW_AT_name        : (indirect string, offset: 0xa7d9f): PLLSource
    <b00>   DW_AT_decl_file   : 9
    <b01>   DW_AT_decl_line   : 50
    <b02>   DW_AT_decl_column : 12
    <b03>   DW_AT_type        : <0xc0>
    <b07>   DW_AT_data_member_location: 4
 <2><b08>: Abbrev Number: 1 (DW_TAG_member)
    <b09>   DW_AT_name        : (indirect string, offset: 0xc78a2): PLLM
    <b0d>   DW_AT_decl_file   : 9
    <b0e>   DW_AT_decl_line   : 53
    <b0f>   DW_AT_decl_column : 12
    <b10>   DW_AT_type        : <0xc0>
    <b14>   DW_AT_data_member_location: 8
 <2><b15>: Abbrev Number: 1 (DW_TAG_member)
    <b16>   DW_AT_name        : (indirect string, offset: 0xc78a7): PLLN
    <b1a>   DW_AT_decl_file   : 9
    <b1b>   DW_AT_decl_line   : 56
    <b1c>   DW_AT_decl_column : 12
    <b1d>   DW_AT_type        : <0xc0>
    <b21>   DW_AT_data_member_location: 12
 <2><b22>: Abbrev Number: 1 (DW_TAG_member)
    <b23>   DW_AT_name        : (indirect string, offset: 0xc78c4): PLLP
    <b27>   DW_AT_decl_file   : 9
    <b28>   DW_AT_decl_line   : 59
    <b29>   DW_AT_decl_column : 12
    <b2a>   DW_AT_type        : <0xc0>
    <b2e>   DW_AT_data_member_location: 16
 <2><b2f>: Abbrev Number: 1 (DW_TAG_member)
    <b30>   DW_AT_name        : (indirect string, offset: 0x67baf): PLLQ
    <b34>   DW_AT_decl_file   : 9
    <b35>   DW_AT_decl_line   : 62
    <b36>   DW_AT_decl_column : 12
    <b37>   DW_AT_type        : <0xc0>
    <b3b>   DW_AT_data_member_location: 20
 <2><b3c>: Abbrev Number: 0
 <1><b3d>: Abbrev Number: 5 (DW_TAG_typedef)
    <b3e>   DW_AT_name        : (indirect string, offset: 0x90afe): RCC_PLLInitTypeDef
    <b42>   DW_AT_decl_file   : 9
    <b43>   DW_AT_decl_line   : 69
    <b44>   DW_AT_decl_column : 2
    <b45>   DW_AT_type        : <0xae6>
 <1><b49>: Abbrev Number: 13 (DW_TAG_structure_type)
    <b4a>   DW_AT_byte_size   : 48
    <b4b>   DW_AT_decl_file   : 10
    <b4c>   DW_AT_decl_line   : 50
    <b4d>   DW_AT_decl_column : 9
    <b4d>   DW_AT_sibling     : <0xbad>
 <2><b51>: Abbrev Number: 1 (DW_TAG_member)
    <b52>   DW_AT_name        : (indirect string, offset: 0xc3f42): OscillatorType
    <b56>   DW_AT_decl_file   : 10
    <b57>   DW_AT_decl_line   : 52
    <b58>   DW_AT_decl_column : 12
    <b59>   DW_AT_type        : <0xc0>
    <b5d>   DW_AT_data_member_location: 0
 <2><b5e>: Abbrev Number: 1 (DW_TAG_member)
    <b5f>   DW_AT_name        : (indirect string, offset: 0xa44a5): HSEState
    <b63>   DW_AT_decl_file   : 10
    <b64>   DW_AT_decl_line   : 55
    <b65>   DW_AT_decl_column : 12
    <b66>   DW_AT_type        : <0xc0>
    <b6a>   DW_AT_data_member_location: 4
 <2><b6b>: Abbrev Number: 1 (DW_TAG_member)
    <b6c>   DW_AT_name        : (indirect string, offset: 0x96391): LSEState
    <b70>   DW_AT_decl_file   : 10
    <b71>   DW_AT_decl_line   : 58
    <b72>   DW_AT_decl_column : 12
    <b73>   DW_AT_type        : <0xc0>
    <b77>   DW_AT_data_member_location: 8
 <2><b78>: Abbrev Number: 1 (DW_TAG_member)
    <b79>   DW_AT_name        : (indirect string, offset: 0x6b0b9): HSIState
    <b7d>   DW_AT_decl_file   : 10
    <b7e>   DW_AT_decl_line   : 61
    <b7f>   DW_AT_decl_column : 12
    <b80>   DW_AT_type        : <0xc0>
    <b84>   DW_AT_data_member_location: 12
 <2><b85>: Abbrev Number: 1 (DW_TAG_member)
    <b86>   DW_AT_name        : (indirect string, offset: 0xcf875): HSICalibrationValue
    <b8a>   DW_AT_decl_file   : 10
    <b8b>   DW_AT_decl_line   : 64
    <b8c>   DW_AT_decl_column : 12
    <b8d>   DW_AT_type        : <0xc0>
    <b91>   DW_AT_data_member_location: 16
 <2><b92>: Abbrev Number: 1 (DW_TAG_member)
    <b93>   DW_AT_name        : (indirect string, offset: 0x5421d): LSIState
    <b97>   DW_AT_decl_file   : 10
    <b98>   DW_AT_decl_line   : 67
    <b99>   DW_AT_decl_column : 12
    <b9a>   DW_AT_type        : <0xc0>
    <b9e>   DW_AT_data_member_location: 20
 <2><b9f>: Abbrev Number: 27 (DW_TAG_member)
    <ba0>   DW_AT_name        : PLL
    <ba4>   DW_AT_decl_file   : 10
    <ba5>   DW_AT_decl_line   : 70
    <ba6>   DW_AT_decl_column : 22
    <ba7>   DW_AT_type        : <0xb3d>
    <bab>   DW_AT_data_member_location: 24
 <2><bac>: Abbrev Number: 0
 <1><bad>: Abbrev Number: 5 (DW_TAG_typedef)
    <bae>   DW_AT_name        : (indirect string, offset: 0x7f59d): RCC_OscInitTypeDef
    <bb2>   DW_AT_decl_file   : 10
    <bb3>   DW_AT_decl_line   : 72
    <bb4>   DW_AT_decl_column : 2
    <bb5>   DW_AT_type        : <0xb49>
 <1><bb9>: Abbrev Number: 13 (DW_TAG_structure_type)
    <bba>   DW_AT_byte_size   : 20
    <bbb>   DW_AT_decl_file   : 10
    <bbc>   DW_AT_decl_line   : 77
    <bbd>   DW_AT_decl_column : 9
    <bbd>   DW_AT_sibling     : <0xc03>
 <2><bc1>: Abbrev Number: 1 (DW_TAG_member)
    <bc2>   DW_AT_name        : (indirect string, offset: 0x49d04): ClockType
    <bc6>   DW_AT_decl_file   : 10
    <bc7>   DW_AT_decl_line   : 79
    <bc8>   DW_AT_decl_column : 12
    <bc9>   DW_AT_type        : <0xc0>
    <bcd>   DW_AT_data_member_location: 0
 <2><bce>: Abbrev Number: 1 (DW_TAG_member)
    <bcf>   DW_AT_name        : (indirect string, offset: 0x90646): SYSCLKSource
    <bd3>   DW_AT_decl_file   : 10
    <bd4>   DW_AT_decl_line   : 82
    <bd5>   DW_AT_decl_column : 12
    <bd6>   DW_AT_type        : <0xc0>
    <bda>   DW_AT_data_member_location: 4
 <2><bdb>: Abbrev Number: 1 (DW_TAG_member)
    <bdc>   DW_AT_name        : (indirect string, offset: 0xc71c2): AHBCLKDivider
    <be0>   DW_AT_decl_file   : 10
    <be1>   DW_AT_decl_line   : 85
    <be2>   DW_AT_decl_column : 12
    <be3>   DW_AT_type        : <0xc0>
    <be7>   DW_AT_data_member_location: 8
 <2><be8>: Abbrev Number: 1 (DW_TAG_member)
    <be9>   DW_AT_name        : (indirect string, offset: 0x9554): APB1CLKDivider
    <bed>   DW_AT_decl_file   : 10
    <bee>   DW_AT_decl_line   : 88
    <bef>   DW_AT_decl_column : 12
    <bf0>   DW_AT_type        : <0xc0>
    <bf4>   DW_AT_data_member_location: 12
 <2><bf5>: Abbrev Number: 1 (DW_TAG_member)
    <bf6>   DW_AT_name        : (indirect string, offset: 0x6dd81): APB2CLKDivider
    <bfa>   DW_AT_decl_file   : 10
    <bfb>   DW_AT_decl_line   : 91
    <bfc>   DW_AT_decl_column : 12
    <bfd>   DW_AT_type        : <0xc0>
    <c01>   DW_AT_data_member_location: 16
 <2><c02>: Abbrev Number: 0
 <1><c03>: Abbrev Number: 5 (DW_TAG_typedef)
    <c04>   DW_AT_name        : (indirect string, offset: 0xb9de3): RCC_ClkInitTypeDef
    <c08>   DW_AT_decl_file   : 10
    <c09>   DW_AT_decl_line   : 94
    <c0a>   DW_AT_decl_column : 2
    <c0b>   DW_AT_type        : <0xbb9>
 <1><c0f>: Abbrev Number: 13 (DW_TAG_structure_type)
    <c10>   DW_AT_byte_size   : 20
    <c11>   DW_AT_decl_file   : 11
    <c12>   DW_AT_decl_line   : 46
    <c13>   DW_AT_decl_column : 9
    <c13>   DW_AT_sibling     : <0xc59>
 <2><c17>: Abbrev Number: 27 (DW_TAG_member)
    <c18>   DW_AT_name        : Pin
    <c1c>   DW_AT_decl_file   : 11
    <c1d>   DW_AT_decl_line   : 48
    <c1e>   DW_AT_decl_column : 12
    <c1f>   DW_AT_type        : <0xc0>
    <c23>   DW_AT_data_member_location: 0
 <2><c24>: Abbrev Number: 1 (DW_TAG_member)
    <c25>   DW_AT_name        : (indirect string, offset: 0x67dcb): Mode
    <c29>   DW_AT_decl_file   : 11
    <c2a>   DW_AT_decl_line   : 51
    <c2b>   DW_AT_decl_column : 12
    <c2c>   DW_AT_type        : <0xc0>
    <c30>   DW_AT_data_member_location: 4
 <2><c31>: Abbrev Number: 1 (DW_TAG_member)
    <c32>   DW_AT_name        : (indirect string, offset: 0x7b66b): Pull
    <c36>   DW_AT_decl_file   : 11
    <c37>   DW_AT_decl_line   : 54
    <c38>   DW_AT_decl_column : 12
    <c39>   DW_AT_type        : <0xc0>
    <c3d>   DW_AT_data_member_location: 8
 <2><c3e>: Abbrev Number: 1 (DW_TAG_member)
    <c3f>   DW_AT_name        : (indirect string, offset: 0xf7a43): Speed
    <c43>   DW_AT_decl_file   : 11
    <c44>   DW_AT_decl_line   : 57
    <c45>   DW_AT_decl_column : 12
    <c46>   DW_AT_type        : <0xc0>
    <c4a>   DW_AT_data_member_location: 12
 <2><c4b>: Abbrev Number: 1 (DW_TAG_member)
    <c4c>   DW_AT_name        : (indirect string, offset: 0x6dd42): Alternate
    <c50>   DW_AT_decl_file   : 11
    <c51>   DW_AT_decl_line   : 60
    <c52>   DW_AT_decl_column : 12
    <c53>   DW_AT_type        : <0xc0>
    <c57>   DW_AT_data_member_location: 16
 <2><c58>: Abbrev Number: 0
 <1><c59>: Abbrev Number: 5 (DW_TAG_typedef)
    <c5a>   DW_AT_name        : (indirect string, offset: 0xbc828): GPIO_InitTypeDef
    <c5e>   DW_AT_decl_file   : 11
    <c5f>   DW_AT_decl_line   : 62
    <c60>   DW_AT_decl_column : 2
    <c61>   DW_AT_type        : <0xc0f>
 <1><c65>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <c66>   DW_AT_encoding    : 7	(unsigned)
    <c67>   DW_AT_byte_size   : 1
    <c68>   DW_AT_type        : <0x3d>
    <c6c>   DW_AT_decl_file   : 11
    <c6d>   DW_AT_decl_line   : 68
    <c6e>   DW_AT_decl_column : 1
    <c6f>   DW_AT_sibling     : <0xc80>
 <2><c73>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c74>   DW_AT_name        : (indirect string, offset: 0x32395): GPIO_PIN_RESET
    <c78>   DW_AT_const_value : 0
 <2><c79>: Abbrev Number: 3 (DW_TAG_enumerator)
    <c7a>   DW_AT_name        : (indirect string, offset: 0x2adb5): GPIO_PIN_SET
    <c7e>   DW_AT_const_value : 1
 <2><c7f>: Abbrev Number: 0
 <1><c80>: Abbrev Number: 5 (DW_TAG_typedef)
    <c81>   DW_AT_name        : (indirect string, offset: 0xecbdb): GPIO_PinState
    <c85>   DW_AT_decl_file   : 11
    <c86>   DW_AT_decl_line   : 71
    <c87>   DW_AT_decl_column : 2
    <c88>   DW_AT_type        : <0xc65>
 <1><c8c>: Abbrev Number: 13 (DW_TAG_structure_type)
    <c8d>   DW_AT_byte_size   : 48
    <c8e>   DW_AT_decl_file   : 12
    <c8f>   DW_AT_decl_line   : 48
    <c90>   DW_AT_decl_column : 9
    <c90>   DW_AT_sibling     : <0xd31>
 <2><c94>: Abbrev Number: 1 (DW_TAG_member)
    <c95>   DW_AT_name        : (indirect string, offset: 0xb2eed): Channel
    <c99>   DW_AT_decl_file   : 12
    <c9a>   DW_AT_decl_line   : 50
    <c9b>   DW_AT_decl_column : 12
    <c9c>   DW_AT_type        : <0xc0>
    <ca0>   DW_AT_data_member_location: 0
 <2><ca1>: Abbrev Number: 1 (DW_TAG_member)
    <ca2>   DW_AT_name        : (indirect string, offset: 0x59287): Direction
    <ca6>   DW_AT_decl_file   : 12
    <ca7>   DW_AT_decl_line   : 53
    <ca8>   DW_AT_decl_column : 12
    <ca9>   DW_AT_type        : <0xc0>
    <cad>   DW_AT_data_member_location: 4
 <2><cae>: Abbrev Number: 1 (DW_TAG_member)
    <caf>   DW_AT_name        : (indirect string, offset: 0x102c2): PeriphInc
    <cb3>   DW_AT_decl_file   : 12
    <cb4>   DW_AT_decl_line   : 57
    <cb5>   DW_AT_decl_column : 12
    <cb6>   DW_AT_type        : <0xc0>
    <cba>   DW_AT_data_member_location: 8
 <2><cbb>: Abbrev Number: 1 (DW_TAG_member)
    <cbc>   DW_AT_name        : (indirect string, offset: 0x2646d): MemInc
    <cc0>   DW_AT_decl_file   : 12
    <cc1>   DW_AT_decl_line   : 60
    <cc2>   DW_AT_decl_column : 12
    <cc3>   DW_AT_type        : <0xc0>
    <cc7>   DW_AT_data_member_location: 12
 <2><cc8>: Abbrev Number: 1 (DW_TAG_member)
    <cc9>   DW_AT_name        : (indirect string, offset: 0x771c5): PeriphDataAlignment
    <ccd>   DW_AT_decl_file   : 12
    <cce>   DW_AT_decl_line   : 63
    <ccf>   DW_AT_decl_column : 12
    <cd0>   DW_AT_type        : <0xc0>
    <cd4>   DW_AT_data_member_location: 16
 <2><cd5>: Abbrev Number: 1 (DW_TAG_member)
    <cd6>   DW_AT_name        : (indirect string, offset: 0xd9ea4): MemDataAlignment
    <cda>   DW_AT_decl_file   : 12
    <cdb>   DW_AT_decl_line   : 66
    <cdc>   DW_AT_decl_column : 12
    <cdd>   DW_AT_type        : <0xc0>
    <ce1>   DW_AT_data_member_location: 20
 <2><ce2>: Abbrev Number: 1 (DW_TAG_member)
    <ce3>   DW_AT_name        : (indirect string, offset: 0x67dcb): Mode
    <ce7>   DW_AT_decl_file   : 12
    <ce8>   DW_AT_decl_line   : 69
    <ce9>   DW_AT_decl_column : 12
    <cea>   DW_AT_type        : <0xc0>
    <cee>   DW_AT_data_member_location: 24
 <2><cef>: Abbrev Number: 1 (DW_TAG_member)
    <cf0>   DW_AT_name        : (indirect string, offset: 0xf48b8): Priority
    <cf4>   DW_AT_decl_file   : 12
    <cf5>   DW_AT_decl_line   : 74
    <cf6>   DW_AT_decl_column : 12
    <cf7>   DW_AT_type        : <0xc0>
    <cfb>   DW_AT_data_member_location: 28
 <2><cfc>: Abbrev Number: 1 (DW_TAG_member)
    <cfd>   DW_AT_name        : (indirect string, offset: 0x67dc7): FIFOMode
    <d01>   DW_AT_decl_file   : 12
    <d02>   DW_AT_decl_line   : 77
    <d03>   DW_AT_decl_column : 12
    <d04>   DW_AT_type        : <0xc0>
    <d08>   DW_AT_data_member_location: 32
 <2><d09>: Abbrev Number: 1 (DW_TAG_member)
    <d0a>   DW_AT_name        : (indirect string, offset: 0xb7187): FIFOThreshold
    <d0e>   DW_AT_decl_file   : 12
    <d0f>   DW_AT_decl_line   : 82
    <d10>   DW_AT_decl_column : 12
    <d11>   DW_AT_type        : <0xc0>
    <d15>   DW_AT_data_member_location: 36
 <2><d16>: Abbrev Number: 1 (DW_TAG_member)
    <d17>   DW_AT_name        : (indirect string, offset: 0xb4b60): MemBurst
    <d1b>   DW_AT_decl_file   : 12
    <d1c>   DW_AT_decl_line   : 85
    <d1d>   DW_AT_decl_column : 12
    <d1e>   DW_AT_type        : <0xc0>
    <d22>   DW_AT_data_member_location: 40
 <2><d23>: Abbrev Number: 1 (DW_TAG_member)
    <d24>   DW_AT_name        : (indirect string, offset: 0x523db): PeriphBurst
    <d28>   DW_AT_decl_file   : 12
    <d29>   DW_AT_decl_line   : 91
    <d2a>   DW_AT_decl_column : 12
    <d2b>   DW_AT_type        : <0xc0>
    <d2f>   DW_AT_data_member_location: 44
 <2><d30>: Abbrev Number: 0
 <1><d31>: Abbrev Number: 5 (DW_TAG_typedef)
    <d32>   DW_AT_name        : (indirect string, offset: 0x40dec): DMA_InitTypeDef
    <d36>   DW_AT_decl_file   : 12
    <d37>   DW_AT_decl_line   : 96
    <d38>   DW_AT_decl_column : 2
    <d39>   DW_AT_type        : <0xc8c>
 <1><d3d>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <d3e>   DW_AT_encoding    : 7	(unsigned)
    <d3f>   DW_AT_byte_size   : 1
    <d40>   DW_AT_type        : <0x3d>
    <d44>   DW_AT_decl_file   : 12
    <d45>   DW_AT_decl_line   : 102
    <d46>   DW_AT_decl_column : 1
    <d47>   DW_AT_sibling     : <0xd70>
 <2><d4b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d4c>   DW_AT_name        : (indirect string, offset: 0xb37e3): HAL_DMA_STATE_RESET
    <d50>   DW_AT_const_value : 0
 <2><d51>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d52>   DW_AT_name        : (indirect string, offset: 0x4254d): HAL_DMA_STATE_READY
    <d56>   DW_AT_const_value : 1
 <2><d57>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d58>   DW_AT_name        : (indirect string, offset: 0xa773e): HAL_DMA_STATE_BUSY
    <d5c>   DW_AT_const_value : 2
 <2><d5d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d5e>   DW_AT_name        : (indirect string, offset: 0xed133): HAL_DMA_STATE_TIMEOUT
    <d62>   DW_AT_const_value : 3
 <2><d63>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d64>   DW_AT_name        : (indirect string, offset: 0xceae2): HAL_DMA_STATE_ERROR
    <d68>   DW_AT_const_value : 4
 <2><d69>: Abbrev Number: 3 (DW_TAG_enumerator)
    <d6a>   DW_AT_name        : (indirect string, offset: 0x36ed4): HAL_DMA_STATE_ABORT
    <d6e>   DW_AT_const_value : 5
 <2><d6f>: Abbrev Number: 0
 <1><d70>: Abbrev Number: 5 (DW_TAG_typedef)
    <d71>   DW_AT_name        : (indirect string, offset: 0x84048): HAL_DMA_StateTypeDef
    <d75>   DW_AT_decl_file   : 12
    <d76>   DW_AT_decl_line   : 109
    <d77>   DW_AT_decl_column : 2
    <d78>   DW_AT_type        : <0xd3d>
 <1><d7c>: Abbrev Number: 18 (DW_TAG_volatile_type)
    <d7d>   DW_AT_type        : <0xd70>
 <1><d81>: Abbrev Number: 29 (DW_TAG_structure_type)
    <d82>   DW_AT_name        : (indirect string, offset: 0xcd86a): __DMA_HandleTypeDef
    <d86>   DW_AT_byte_size   : 96
    <d87>   DW_AT_decl_file   : 12
    <d88>   DW_AT_decl_line   : 137
    <d89>   DW_AT_decl_column : 16
    <d89>   DW_AT_sibling     : <0xe44>
 <2><d8d>: Abbrev Number: 1 (DW_TAG_member)
    <d8e>   DW_AT_name        : (indirect string, offset: 0xe90fa): Instance
    <d92>   DW_AT_decl_file   : 12
    <d93>   DW_AT_decl_line   : 139
    <d94>   DW_AT_decl_column : 31
    <d95>   DW_AT_type        : <0xe44>
    <d99>   DW_AT_data_member_location: 0
 <2><d9a>: Abbrev Number: 1 (DW_TAG_member)
    <d9b>   DW_AT_name        : (indirect string, offset: 0xf6f3c): Init
    <d9f>   DW_AT_decl_file   : 12
    <da0>   DW_AT_decl_line   : 141
    <da1>   DW_AT_decl_column : 30
    <da2>   DW_AT_type        : <0xd31>
    <da6>   DW_AT_data_member_location: 4
 <2><da7>: Abbrev Number: 1 (DW_TAG_member)
    <da8>   DW_AT_name        : (indirect string, offset: 0xabe12): Lock
    <dac>   DW_AT_decl_file   : 12
    <dad>   DW_AT_decl_line   : 143
    <dae>   DW_AT_decl_column : 30
    <daf>   DW_AT_type        : <0xada>
    <db3>   DW_AT_data_member_location: 52
 <2><db4>: Abbrev Number: 1 (DW_TAG_member)
    <db5>   DW_AT_name        : (indirect string, offset: 0xa44a8): State
    <db9>   DW_AT_decl_file   : 12
    <dba>   DW_AT_decl_line   : 145
    <dbb>   DW_AT_decl_column : 30
    <dbc>   DW_AT_type        : <0xd7c>
    <dc0>   DW_AT_data_member_location: 53
 <2><dc1>: Abbrev Number: 1 (DW_TAG_member)
    <dc2>   DW_AT_name        : (indirect string, offset: 0xe5747): Parent
    <dc6>   DW_AT_decl_file   : 12
    <dc7>   DW_AT_decl_line   : 147
    <dc8>   DW_AT_decl_column : 31
    <dc9>   DW_AT_type        : <0xe49>
    <dcd>   DW_AT_data_member_location: 56
 <2><dce>: Abbrev Number: 1 (DW_TAG_member)
    <dcf>   DW_AT_name        : (indirect string, offset: 0xefc3c): XferCpltCallback
    <dd3>   DW_AT_decl_file   : 12
    <dd4>   DW_AT_decl_line   : 149
    <dd5>   DW_AT_decl_column : 33
    <dd6>   DW_AT_type        : <0xe60>
    <dda>   DW_AT_data_member_location: 60
 <2><ddb>: Abbrev Number: 1 (DW_TAG_member)
    <ddc>   DW_AT_name        : (indirect string, offset: 0xbb49f): XferHalfCpltCallback
    <de0>   DW_AT_decl_file   : 12
    <de1>   DW_AT_decl_line   : 151
    <de2>   DW_AT_decl_column : 33
    <de3>   DW_AT_type        : <0xe60>
    <de7>   DW_AT_data_member_location: 64
 <2><de8>: Abbrev Number: 1 (DW_TAG_member)
    <de9>   DW_AT_name        : (indirect string, offset: 0xdcf1b): XferM1CpltCallback
    <ded>   DW_AT_decl_file   : 12
    <dee>   DW_AT_decl_line   : 153
    <def>   DW_AT_decl_column : 33
    <df0>   DW_AT_type        : <0xe60>
    <df4>   DW_AT_data_member_location: 68
 <2><df5>: Abbrev Number: 1 (DW_TAG_member)
    <df6>   DW_AT_name        : (indirect string, offset: 0x734a5): XferM1HalfCpltCallback
    <dfa>   DW_AT_decl_file   : 12
    <dfb>   DW_AT_decl_line   : 155
    <dfc>   DW_AT_decl_column : 33
    <dfd>   DW_AT_type        : <0xe60>
    <e01>   DW_AT_data_member_location: 72
 <2><e02>: Abbrev Number: 1 (DW_TAG_member)
    <e03>   DW_AT_name        : (indirect string, offset: 0x22dfb): XferErrorCallback
    <e07>   DW_AT_decl_file   : 12
    <e08>   DW_AT_decl_line   : 157
    <e09>   DW_AT_decl_column : 33
    <e0a>   DW_AT_type        : <0xe60>
    <e0e>   DW_AT_data_member_location: 76
 <2><e0f>: Abbrev Number: 1 (DW_TAG_member)
    <e10>   DW_AT_name        : (indirect string, offset: 0xe1129): XferAbortCallback
    <e14>   DW_AT_decl_file   : 12
    <e15>   DW_AT_decl_line   : 159
    <e16>   DW_AT_decl_column : 33
    <e17>   DW_AT_type        : <0xe60>
    <e1b>   DW_AT_data_member_location: 80
 <2><e1c>: Abbrev Number: 1 (DW_TAG_member)
    <e1d>   DW_AT_name        : (indirect string, offset: 0x83e65): ErrorCode
    <e21>   DW_AT_decl_file   : 12
    <e22>   DW_AT_decl_line   : 161
    <e23>   DW_AT_decl_column : 30
    <e24>   DW_AT_type        : <0xcc>
    <e28>   DW_AT_data_member_location: 84
 <2><e29>: Abbrev Number: 1 (DW_TAG_member)
    <e2a>   DW_AT_name        : (indirect string, offset: 0x6b564): StreamBaseAddress
    <e2e>   DW_AT_decl_file   : 12
    <e2f>   DW_AT_decl_line   : 163
    <e30>   DW_AT_decl_column : 30
    <e31>   DW_AT_type        : <0xc0>
    <e35>   DW_AT_data_member_location: 88
 <2><e36>: Abbrev Number: 1 (DW_TAG_member)
    <e37>   DW_AT_name        : (indirect string, offset: 0xca752): StreamIndex
    <e3b>   DW_AT_decl_file   : 12
    <e3c>   DW_AT_decl_line   : 165
    <e3d>   DW_AT_decl_column : 30
    <e3e>   DW_AT_type        : <0xc0>
    <e42>   DW_AT_data_member_location: 92
 <2><e43>: Abbrev Number: 0
 <1><e44>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e45>   DW_AT_byte_size   : 4
    <e45>   DW_AT_type        : <0x158>
 <1><e49>: Abbrev Number: 45 (DW_TAG_pointer_type)
    <e4a>   DW_AT_byte_size   : 4
 <1><e4b>: Abbrev Number: 15 (DW_TAG_const_type)
    <e4c>   DW_AT_type        : <0xe49>
 <1><e50>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <e51>   DW_AT_prototyped  : 1
    <e51>   DW_AT_sibling     : <0xe5b>
 <2><e55>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e56>   DW_AT_type        : <0xe5b>
 <2><e5a>: Abbrev Number: 0
 <1><e5b>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e5c>   DW_AT_byte_size   : 4
    <e5c>   DW_AT_type        : <0xd81>
 <1><e60>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e61>   DW_AT_byte_size   : 4
    <e61>   DW_AT_type        : <0xe50>
 <1><e65>: Abbrev Number: 5 (DW_TAG_typedef)
    <e66>   DW_AT_name        : (indirect string, offset: 0xcd86c): DMA_HandleTypeDef
    <e6a>   DW_AT_decl_file   : 12
    <e6b>   DW_AT_decl_line   : 167
    <e6c>   DW_AT_decl_column : 2
    <e6d>   DW_AT_type        : <0xd81>
 <1><e71>: Abbrev Number: 13 (DW_TAG_structure_type)
    <e72>   DW_AT_byte_size   : 40
    <e73>   DW_AT_decl_file   : 13
    <e74>   DW_AT_decl_line   : 59
    <e75>   DW_AT_decl_column : 9
    <e75>   DW_AT_sibling     : <0xefc>
 <2><e79>: Abbrev Number: 1 (DW_TAG_member)
    <e7a>   DW_AT_name        : (indirect string, offset: 0x8f49d): DESC0
    <e7e>   DW_AT_decl_file   : 13
    <e7f>   DW_AT_decl_line   : 61
    <e80>   DW_AT_decl_column : 17
    <e81>   DW_AT_type        : <0xcc>
    <e85>   DW_AT_data_member_location: 0
 <2><e86>: Abbrev Number: 1 (DW_TAG_member)
    <e87>   DW_AT_name        : (indirect string, offset: 0x50f61): DESC1
    <e8b>   DW_AT_decl_file   : 13
    <e8c>   DW_AT_decl_line   : 62
    <e8d>   DW_AT_decl_column : 17
    <e8e>   DW_AT_type        : <0xcc>
    <e92>   DW_AT_data_member_location: 4
 <2><e93>: Abbrev Number: 1 (DW_TAG_member)
    <e94>   DW_AT_name        : (indirect string, offset: 0xcefea): DESC2
    <e98>   DW_AT_decl_file   : 13
    <e99>   DW_AT_decl_line   : 63
    <e9a>   DW_AT_decl_column : 17
    <e9b>   DW_AT_type        : <0xcc>
    <e9f>   DW_AT_data_member_location: 8
 <2><ea0>: Abbrev Number: 1 (DW_TAG_member)
    <ea1>   DW_AT_name        : (indirect string, offset: 0x50f8b): DESC3
    <ea5>   DW_AT_decl_file   : 13
    <ea6>   DW_AT_decl_line   : 64
    <ea7>   DW_AT_decl_column : 17
    <ea8>   DW_AT_type        : <0xcc>
    <eac>   DW_AT_data_member_location: 12
 <2><ead>: Abbrev Number: 1 (DW_TAG_member)
    <eae>   DW_AT_name        : (indirect string, offset: 0x50f91): DESC4
    <eb2>   DW_AT_decl_file   : 13
    <eb3>   DW_AT_decl_line   : 65
    <eb4>   DW_AT_decl_column : 17
    <eb5>   DW_AT_type        : <0xcc>
    <eb9>   DW_AT_data_member_location: 16
 <2><eba>: Abbrev Number: 1 (DW_TAG_member)
    <ebb>   DW_AT_name        : (indirect string, offset: 0x50f97): DESC5
    <ebf>   DW_AT_decl_file   : 13
    <ec0>   DW_AT_decl_line   : 66
    <ec1>   DW_AT_decl_column : 17
    <ec2>   DW_AT_type        : <0xcc>
    <ec6>   DW_AT_data_member_location: 20
 <2><ec7>: Abbrev Number: 1 (DW_TAG_member)
    <ec8>   DW_AT_name        : (indirect string, offset: 0x50f9d): DESC6
    <ecc>   DW_AT_decl_file   : 13
    <ecd>   DW_AT_decl_line   : 67
    <ece>   DW_AT_decl_column : 17
    <ecf>   DW_AT_type        : <0xcc>
    <ed3>   DW_AT_data_member_location: 24
 <2><ed4>: Abbrev Number: 1 (DW_TAG_member)
    <ed5>   DW_AT_name        : (indirect string, offset: 0x50fa3): DESC7
    <ed9>   DW_AT_decl_file   : 13
    <eda>   DW_AT_decl_line   : 68
    <edb>   DW_AT_decl_column : 17
    <edc>   DW_AT_type        : <0xcc>
    <ee0>   DW_AT_data_member_location: 28
 <2><ee1>: Abbrev Number: 1 (DW_TAG_member)
    <ee2>   DW_AT_name        : (indirect string, offset: 0x8bfea): BackupAddr0
    <ee6>   DW_AT_decl_file   : 13
    <ee7>   DW_AT_decl_line   : 69
    <ee8>   DW_AT_decl_column : 12
    <ee9>   DW_AT_type        : <0xc0>
    <eed>   DW_AT_data_member_location: 32
 <2><eee>: Abbrev Number: 1 (DW_TAG_member)
    <eef>   DW_AT_name        : (indirect string, offset: 0x2bab9): BackupAddr1
    <ef3>   DW_AT_decl_file   : 13
    <ef4>   DW_AT_decl_line   : 70
    <ef5>   DW_AT_decl_column : 12
    <ef6>   DW_AT_type        : <0xc0>
    <efa>   DW_AT_data_member_location: 36
 <2><efb>: Abbrev Number: 0
 <1><efc>: Abbrev Number: 5 (DW_TAG_typedef)
    <efd>   DW_AT_name        : (indirect string, offset: 0xdbe18): ETH_DMADescTypeDef
    <f01>   DW_AT_decl_file   : 13
    <f02>   DW_AT_decl_line   : 71
    <f03>   DW_AT_decl_column : 3
    <f04>   DW_AT_type        : <0xe71>
 <1><f08>: Abbrev Number: 29 (DW_TAG_structure_type)
    <f09>   DW_AT_name        : (indirect string, offset: 0x54bc2): __ETH_BufferTypeDef
    <f0d>   DW_AT_byte_size   : 12
    <f0e>   DW_AT_decl_file   : 13
    <f0f>   DW_AT_decl_line   : 79
    <f10>   DW_AT_decl_column : 16
    <f10>   DW_AT_sibling     : <0xf3c>
 <2><f14>: Abbrev Number: 1 (DW_TAG_member)
    <f15>   DW_AT_name        : (indirect string, offset: 0xf4dc3): buffer
    <f19>   DW_AT_decl_file   : 13
    <f1a>   DW_AT_decl_line   : 81
    <f1b>   DW_AT_decl_column : 12
    <f1c>   DW_AT_type        : <0xf3c>
    <f20>   DW_AT_data_member_location: 0
 <2><f21>: Abbrev Number: 27 (DW_TAG_member)
    <f22>   DW_AT_name        : len
    <f26>   DW_AT_decl_file   : 13
    <f27>   DW_AT_decl_line   : 83
    <f28>   DW_AT_decl_column : 12
    <f29>   DW_AT_type        : <0xc0>
    <f2d>   DW_AT_data_member_location: 4
 <2><f2e>: Abbrev Number: 1 (DW_TAG_member)
    <f2f>   DW_AT_name        : (indirect string, offset: 0xd0441): next
    <f33>   DW_AT_decl_file   : 13
    <f34>   DW_AT_decl_line   : 85
    <f35>   DW_AT_decl_column : 31
    <f36>   DW_AT_type        : <0xf41>
    <f3a>   DW_AT_data_member_location: 8
 <2><f3b>: Abbrev Number: 0
 <1><f3c>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <f3d>   DW_AT_byte_size   : 4
    <f3d>   DW_AT_type        : <0x94>
 <1><f41>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <f42>   DW_AT_byte_size   : 4
    <f42>   DW_AT_type        : <0xf08>
 <1><f46>: Abbrev Number: 5 (DW_TAG_typedef)
    <f47>   DW_AT_name        : (indirect string, offset: 0x54bc4): ETH_BufferTypeDef
    <f4b>   DW_AT_decl_file   : 13
    <f4c>   DW_AT_decl_line   : 86
    <f4d>   DW_AT_decl_column : 3
    <f4e>   DW_AT_type        : <0xf08>
 <1><f52>: Abbrev Number: 13 (DW_TAG_structure_type)
    <f53>   DW_AT_byte_size   : 48
    <f54>   DW_AT_decl_file   : 13
    <f55>   DW_AT_decl_line   : 94
    <f56>   DW_AT_decl_column : 9
    <f56>   DW_AT_sibling     : <0xfa9>
 <2><f5a>: Abbrev Number: 1 (DW_TAG_member)
    <f5b>   DW_AT_name        : (indirect string, offset: 0x41c98): TxDesc
    <f5f>   DW_AT_decl_file   : 13
    <f60>   DW_AT_decl_line   : 96
    <f61>   DW_AT_decl_column : 13
    <f62>   DW_AT_type        : <0xfa9>
    <f66>   DW_AT_data_member_location: 0
 <2><f67>: Abbrev Number: 1 (DW_TAG_member)
    <f68>   DW_AT_name        : (indirect string, offset: 0x41c95): CurTxDesc
    <f6c>   DW_AT_decl_file   : 13
    <f6d>   DW_AT_decl_line   : 98
    <f6e>   DW_AT_decl_column : 13
    <f6f>   DW_AT_type        : <0xc0>
    <f73>   DW_AT_data_member_location: 16
 <2><f74>: Abbrev Number: 1 (DW_TAG_member)
    <f75>   DW_AT_name        : (indirect string, offset: 0xc0069): PacketAddress
    <f79>   DW_AT_decl_file   : 13
    <f7a>   DW_AT_decl_line   : 100
    <f7b>   DW_AT_decl_column : 13
    <f7c>   DW_AT_type        : <0xfb9>
    <f80>   DW_AT_data_member_location: 20
 <2><f81>: Abbrev Number: 1 (DW_TAG_member)
    <f82>   DW_AT_name        : (indirect string, offset: 0xc0062): CurrentPacketAddress
    <f86>   DW_AT_decl_file   : 13
    <f87>   DW_AT_decl_line   : 102
    <f88>   DW_AT_decl_column : 13
    <f89>   DW_AT_type        : <0xfc9>
    <f8d>   DW_AT_data_member_location: 36
 <2><f8e>: Abbrev Number: 1 (DW_TAG_member)
    <f8f>   DW_AT_name        : (indirect string, offset: 0x377b9): BuffersInUse
    <f93>   DW_AT_decl_file   : 13
    <f94>   DW_AT_decl_line   : 104
    <f95>   DW_AT_decl_column : 12
    <f96>   DW_AT_type        : <0xc0>
    <f9a>   DW_AT_data_member_location: 40
 <2><f9b>: Abbrev Number: 1 (DW_TAG_member)
    <f9c>   DW_AT_name        : (indirect string, offset: 0x4d2dc): releaseIndex
    <fa0>   DW_AT_decl_file   : 13
    <fa1>   DW_AT_decl_line   : 106
    <fa2>   DW_AT_decl_column : 12
    <fa3>   DW_AT_type        : <0xc0>
    <fa7>   DW_AT_data_member_location: 44
 <2><fa8>: Abbrev Number: 0
 <1><fa9>: Abbrev Number: 10 (DW_TAG_array_type)
    <faa>   DW_AT_type        : <0xc0>
    <fae>   DW_AT_sibling     : <0xfb9>
 <2><fb2>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <fb3>   DW_AT_type        : <0x8d>
    <fb7>   DW_AT_upper_bound : 3
 <2><fb8>: Abbrev Number: 0
 <1><fb9>: Abbrev Number: 10 (DW_TAG_array_type)
    <fba>   DW_AT_type        : <0xfc9>
    <fbe>   DW_AT_sibling     : <0xfc9>
 <2><fc2>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <fc3>   DW_AT_type        : <0x8d>
    <fc7>   DW_AT_upper_bound : 3
 <2><fc8>: Abbrev Number: 0
 <1><fc9>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <fca>   DW_AT_byte_size   : 4
    <fca>   DW_AT_type        : <0xc0>
 <1><fce>: Abbrev Number: 5 (DW_TAG_typedef)
    <fcf>   DW_AT_name        : (indirect string, offset: 0xc53b0): ETH_TxDescListTypeDef
    <fd3>   DW_AT_decl_file   : 13
    <fd4>   DW_AT_decl_line   : 107
    <fd5>   DW_AT_decl_column : 3
    <fd6>   DW_AT_type        : <0xf52>
 <1><fda>: Abbrev Number: 13 (DW_TAG_structure_type)
    <fdb>   DW_AT_byte_size   : 56
    <fdc>   DW_AT_decl_file   : 13
    <fdd>   DW_AT_decl_line   : 115
    <fde>   DW_AT_decl_column : 9
    <fde>   DW_AT_sibling     : <0x1099>
 <2><fe2>: Abbrev Number: 1 (DW_TAG_member)
    <fe3>   DW_AT_name        : (indirect string, offset: 0x9db8f): Attributes
    <fe7>   DW_AT_decl_file   : 13
    <fe8>   DW_AT_decl_line   : 117
    <fe9>   DW_AT_decl_column : 12
    <fea>   DW_AT_type        : <0xc0>
    <fee>   DW_AT_data_member_location: 0
 <2><fef>: Abbrev Number: 1 (DW_TAG_member)
    <ff0>   DW_AT_name        : (indirect string, offset: 0x4ff5e): Length
    <ff4>   DW_AT_decl_file   : 13
    <ff5>   DW_AT_decl_line   : 120
    <ff6>   DW_AT_decl_column : 12
    <ff7>   DW_AT_type        : <0xc0>
    <ffb>   DW_AT_data_member_location: 4
 <2><ffc>: Abbrev Number: 1 (DW_TAG_member)
    <ffd>   DW_AT_name        : (indirect string, offset: 0x84315): TxBuffer
    <1001>   DW_AT_decl_file   : 13
    <1002>   DW_AT_decl_line   : 122
    <1003>   DW_AT_decl_column : 22
    <1004>   DW_AT_type        : <0x1099>
    <1008>   DW_AT_data_member_location: 8
 <2><1009>: Abbrev Number: 1 (DW_TAG_member)
    <100a>   DW_AT_name        : (indirect string, offset: 0x93899): SrcAddrCtrl
    <100e>   DW_AT_decl_file   : 13
    <100f>   DW_AT_decl_line   : 124
    <1010>   DW_AT_decl_column : 12
    <1011>   DW_AT_type        : <0xc0>
    <1015>   DW_AT_data_member_location: 12
 <2><1016>: Abbrev Number: 1 (DW_TAG_member)
    <1017>   DW_AT_name        : (indirect string, offset: 0xcf3b1): CRCPadCtrl
    <101b>   DW_AT_decl_file   : 13
    <101c>   DW_AT_decl_line   : 127
    <101d>   DW_AT_decl_column : 12
    <101e>   DW_AT_type        : <0xc0>
    <1022>   DW_AT_data_member_location: 16
 <2><1023>: Abbrev Number: 1 (DW_TAG_member)
    <1024>   DW_AT_name        : (indirect string, offset: 0x420de): ChecksumCtrl
    <1028>   DW_AT_decl_file   : 13
    <1029>   DW_AT_decl_line   : 130
    <102a>   DW_AT_decl_column : 12
    <102b>   DW_AT_type        : <0xc0>
    <102f>   DW_AT_data_member_location: 20
 <2><1030>: Abbrev Number: 1 (DW_TAG_member)
    <1031>   DW_AT_name        : (indirect string, offset: 0x2da13): MaxSegmentSize
    <1035>   DW_AT_decl_file   : 13
    <1036>   DW_AT_decl_line   : 133
    <1037>   DW_AT_decl_column : 12
    <1038>   DW_AT_type        : <0xc0>
    <103c>   DW_AT_data_member_location: 24
 <2><103d>: Abbrev Number: 1 (DW_TAG_member)
    <103e>   DW_AT_name        : (indirect string, offset: 0xa1447): PayloadLen
    <1042>   DW_AT_decl_file   : 13
    <1043>   DW_AT_decl_line   : 136
    <1044>   DW_AT_decl_column : 12
    <1045>   DW_AT_type        : <0xc0>
    <1049>   DW_AT_data_member_location: 28
 <2><104a>: Abbrev Number: 1 (DW_TAG_member)
    <104b>   DW_AT_name        : (indirect string, offset: 0x1e1b): TCPHeaderLen
    <104f>   DW_AT_decl_file   : 13
    <1050>   DW_AT_decl_line   : 139
    <1051>   DW_AT_decl_column : 12
    <1052>   DW_AT_type        : <0xc0>
    <1056>   DW_AT_data_member_location: 32
 <2><1057>: Abbrev Number: 1 (DW_TAG_member)
    <1058>   DW_AT_name        : (indirect string, offset: 0xd5471): VlanTag
    <105c>   DW_AT_decl_file   : 13
    <105d>   DW_AT_decl_line   : 142
    <105e>   DW_AT_decl_column : 12
    <105f>   DW_AT_type        : <0xc0>
    <1063>   DW_AT_data_member_location: 36
 <2><1064>: Abbrev Number: 1 (DW_TAG_member)
    <1065>   DW_AT_name        : (indirect string, offset: 0xb94de): VlanCtrl
    <1069>   DW_AT_decl_file   : 13
    <106a>   DW_AT_decl_line   : 145
    <106b>   DW_AT_decl_column : 12
    <106c>   DW_AT_type        : <0xc0>
    <1070>   DW_AT_data_member_location: 40
 <2><1071>: Abbrev Number: 1 (DW_TAG_member)
    <1072>   DW_AT_name        : (indirect string, offset: 0xd546c): InnerVlanTag
    <1076>   DW_AT_decl_file   : 13
    <1077>   DW_AT_decl_line   : 148
    <1078>   DW_AT_decl_column : 12
    <1079>   DW_AT_type        : <0xc0>
    <107d>   DW_AT_data_member_location: 44
 <2><107e>: Abbrev Number: 1 (DW_TAG_member)
    <107f>   DW_AT_name        : (indirect string, offset: 0xb94d9): InnerVlanCtrl
    <1083>   DW_AT_decl_file   : 13
    <1084>   DW_AT_decl_line   : 151
    <1085>   DW_AT_decl_column : 12
    <1086>   DW_AT_type        : <0xc0>
    <108a>   DW_AT_data_member_location: 48
 <2><108b>: Abbrev Number: 1 (DW_TAG_member)
    <108c>   DW_AT_name        : (indirect string, offset: 0x3f105): pData
    <1090>   DW_AT_decl_file   : 13
    <1091>   DW_AT_decl_line   : 154
    <1092>   DW_AT_decl_column : 9
    <1093>   DW_AT_type        : <0xe49>
    <1097>   DW_AT_data_member_location: 52
 <2><1098>: Abbrev Number: 0
 <1><1099>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <109a>   DW_AT_byte_size   : 4
    <109a>   DW_AT_type        : <0xf46>
 <1><109e>: Abbrev Number: 5 (DW_TAG_typedef)
    <109f>   DW_AT_name        : (indirect string, offset: 0xa9c0a): ETH_TxPacketConfig
